{
  "exam_metadata": {
    "subject": "Lịch sử 12 - Chân trời sáng tạo",
    "scope": "Bài 6: Cách mạng tháng Tám năm 1945 & Bài 7: Cuộc kháng chiến chống thực dân Pháp (1945-1954)",
    "source_pages": "33 - 45"
  },
  "questions": [
    {
      "question_number": 1,
      "question": "Theo tư liệu 'Thư kêu gọi Tổng khởi nghĩa' (trang 34), Chủ tịch Hồ Chí Minh đã nhận định thời cơ như thế nào?",
      "answer_options": [
        {
          "text": "Giờ quyết định cho vận mệnh dân tộc ta đã đến.",
          "rationale": "Trích nguyên văn Tư liệu trang 34: 'Hỡi đồng bào yêu quý! Giờ quyết định cho vận mệnh dân tộc ta đã đến. Toàn quốc đồng bào hãy đứng dậy đem sức ta mà tự giải phóng cho ta'.",
          "isCorrect": true
        },
        {
          "text": "Chúng ta cần chờ quân Đồng minh vào giải giáp.",
          "rationale": "Sai, Bác kêu gọi 'đem sức ta mà tự giải phóng cho ta' chứ không chờ đợi.",
          "isCorrect": false
        },
        {
          "text": "Phải thương lượng với Nhật để giành độc lập.",
          "rationale": "Sai, chủ trương là dùng bạo lực cách mạng giành chính quyền.",
          "isCorrect": false
        },
        {
          "text": "Cần tranh thủ sự ủng hộ của Pháp để chống Nhật.",
          "rationale": "Sai hoàn toàn về đường lối.",
          "isCorrect": false
        }
      ],
      "hint": "Câu mở đầu trong bức thư của Bác gửi đồng bào cả nước."
    },
    {
      "question_number": 2,
      "question": "Sự kiện Nhật Bản đầu hàng Đồng minh không điều kiện (15/8/1945) đã tạo ra điều kiện khách quan thuận lợi gì cho Cách mạng Việt Nam?",
      "answer_options": [
        {
          "text": "Quân Pháp quay trở lại xâm lược Đông Dương ngay lập tức.",
          "rationale": "Đây là khó khăn, không phải thuận lợi.",
          "isCorrect": false
        },
        {
          "text": "Chính phủ Trần Trọng Kim được củng cố quyền lực.",
          "rationale": "Ngược lại, chính phủ tay sai hoang mang cực độ.",
          "isCorrect": false
        },
        {
          "text": "Kẻ thù chính là quân phiệt Nhật gục ngã, chính quyền tay sai hoang mang, rệu rã.",
          "rationale": "SGK trang 34: Quân Nhật ở Đông Dương rã rời, chính phủ tay sai hoang mang... tạo thời cơ 'ngàn năm có một'.",
          "isCorrect": true
        },
        {
          "text": "Quân Đồng minh đã vào Việt Nam bảo vệ chính quyền cách mạng.",
          "rationale": "Quân Đồng minh chưa vào, và khi vào họ cũng không bảo vệ cách mạng.",
          "isCorrect": false
        }
      ],
      "hint": "Tình trạng của kẻ thù trực tiếp lúc bấy giờ."
    },
    {
      "question_number": 3,
      "question": "Địa phương nào KHÔNG nằm trong nhóm 4 tỉnh giành chính quyền sớm nhất cả nước (từ 14 đến 18/8/1945)?",
      "answer_options": [
        {
          "text": "Bắc Giang.",
          "rationale": "Thuộc nhóm 4 tỉnh sớm nhất.",
          "isCorrect": false
        },
        {
          "text": "Hải Dương.",
          "rationale": "Thuộc nhóm 4 tỉnh sớm nhất.",
          "isCorrect": false
        },
        {
          "text": "Hà Nội.",
          "rationale": "Hà Nội giành chính quyền ngày 19/8, chậm hơn nhóm 4 tỉnh này.",
          "isCorrect": true
        },
        {
          "text": "Quảng Nam.",
          "rationale": "Thuộc nhóm 4 tỉnh sớm nhất.",
          "isCorrect": false
        }
      ],
      "hint": "Xem sơ đồ diễn biến trang 35. Bốn tỉnh đó là Bắc Giang, Hải Dương, Hà Tĩnh, Quảng Nam."
    },
    {
      "question_number": 4,
      "question": "Hình 6.4 (trang 35) mô tả sự kiện lịch sử nào?",
      "answer_options": [
        {
          "text": "Mít tinh tại Nhà hát Lớn Hà Nội.",
          "rationale": "Hình ảnh là cảnh chiếm Phủ Khâm sai.",
          "isCorrect": false
        },
        {
          "text": "Quần chúng cách mạng và tự vệ chiếm Phủ Khâm sai (Bắc Bộ Phủ).",
          "rationale": "Chú thích Hình 6.4 SGK trang 35: Quần chúng cách mạng và tự vệ chiếm Phủ Khâm sai (Bắc Bộ Phủ) ngày 19-8-1945.",
          "isCorrect": true
        },
        {
          "text": "Vua Bảo Đại thoái vị tại Huế.",
          "rationale": "Sai địa điểm.",
          "isCorrect": false
        },
        {
          "text": "Cuộc mít tinh giành chính quyền ở Sài Gòn.",
          "rationale": "Sai địa điểm.",
          "isCorrect": false
        }
      ],
      "hint": "Sự kiện quan trọng nhất trong ngày 19/8/1945 tại Hà Nội."
    },
    {
      "question_number": 5,
      "question": "Phát biểu nào sau đây là SAI khi nói về nguyên nhân thắng lợi của Cách mạng tháng Tám năm 1945?",
      "answer_options": [
        {
          "text": "Có sự lãnh đạo đúng đắn, sáng tạo của Đảng Cộng sản Đông Dương.",
          "rationale": "Đây là nguyên nhân chủ quan đúng.",
          "isCorrect": false
        },
        {
          "text": "Nhân dân Việt Nam có truyền thống yêu nước nồng nàn.",
          "rationale": "Đây là nguyên nhân chủ quan đúng.",
          "isCorrect": false
        },
        {
          "text": "Quân Đồng minh trực tiếp giúp đỡ Việt Nam đánh Nhật.",
          "rationale": "Sai. Thắng lợi chủ yếu do sức mạnh nội lực của dân tộc ('đem sức ta mà tự giải phóng cho ta'). Đồng minh chỉ gián tiếp tạo thời cơ bằng cách đánh bại Nhật ở các mặt trận khác.",
          "isCorrect": true
        },
        {
          "text": "Chiến thắng của quân Đồng minh trong chiến tranh chống phát xít tạo thời cơ thuận lợi.",
          "rationale": "Đây là nguyên nhân khách quan đúng.",
          "isCorrect": false
        }
      ],
      "hint": "Cách mạng tháng Tám là cuộc cách mạng 'tự lực cánh sinh'."
    },
    {
      "question_number": 6,
      "question": "Đâu là bài học kinh nghiệm về 'nghệ thuật khởi nghĩa' được rút ra từ Cách mạng tháng Tám (SGK trang 36)?",
      "answer_options": [
        {
          "text": "Kết hợp đấu tranh quân sự là chủ yếu với ngoại giao.",
          "rationale": "Cách mạng tháng Tám chưa có đấu tranh ngoại giao mạnh mẽ.",
          "isCorrect": false
        },
        {
          "text": "Kết hợp hài hòa giữa đấu tranh chính trị và đấu tranh vũ trang.",
          "rationale": "SGK trang 36: Bài học về 'kết hợp đấu tranh chính trị với đấu tranh vũ trang, tiến hành khởi nghĩa từng phần tiến tới tổng khởi nghĩa'.",
          "isCorrect": true
        },
        {
          "text": "Chỉ sử dụng bạo lực chính trị của quần chúng.",
          "rationale": "Phải có cả lực lượng vũ trang hỗ trợ.",
          "isCorrect": false
        },
        {
          "text": "Trông chờ vào sự hỗ trợ từ bên ngoài.",
          "rationale": "Bài học là tự lực cánh sinh.",
          "isCorrect": false
        }
      ],
      "hint": "Kết hợp sức mạnh của quần chúng (chính trị) và lực lượng quân sự (vũ trang)."
    },
    {
      "question_number": 7,
      "question": "Theo lời kêu gọi của Chủ tịch Hồ Chí Minh (trang 38), thái độ của nhân dân ta đối với việc thực dân Pháp quay lại xâm lược là gì?",
      "answer_options": [
        {
          "text": "Chấp nhận nhượng bộ để giữ hòa bình.",
          "rationale": "Đoạn trích nói rõ: 'chúng ta càng nhân nhượng, thực dân Pháp càng lấn tới'.",
          "isCorrect": false
        },
        {
          "text": "Thà hi sinh tất cả chứ nhất định không chịu mất nước, nhất định không chịu làm nô lệ.",
          "rationale": "Trích Lời kêu gọi toàn quốc kháng chiến: 'Chúng ta thà hi sinh tất cả, chứ nhất định không chịu mất nước, nhất định không chịu làm nô lệ'.",
          "isCorrect": true
        },
        {
          "text": "Chờ sự can thiệp của Liên Hợp Quốc.",
          "rationale": "Không có trong nội dung.",
          "isCorrect": false
        },
        {
          "text": "Đầu hàng để bảo toàn lực lượng.",
          "rationale": "Sai hoàn toàn tinh thần kháng chiến.",
          "isCorrect": false
        }
      ],
      "hint": "Câu nói nổi tiếng thể hiện quyết tâm sắt đá trong Lời kêu gọi toàn quốc kháng chiến."
    },
    {
      "question_number": 8,
      "question": "Chiến thuật nào được quân dân Sài Gòn - Chợ Lớn sử dụng để chống lại quân Pháp từ ngày 23/9/1945 (trang 39)?",
      "answer_options": [
        {
          "text": "Tấn công trực diện vào các đồn bốt lớn.",
          "rationale": "Lực lượng ta còn yếu, không thể tấn công trực diện ngay.",
          "isCorrect": false
        },
        {
          "text": "Trong đánh ngoài vây, đốt cháy tàu Pháp, phá kho tàng, dựng chướng ngại vật.",
          "rationale": "SGK trang 39: 'thiết lập mặt trận trong đánh ngoài vây... đốt cháy tàu Pháp... dựng chướng ngại vật'.",
          "isCorrect": true
        },
        {
          "text": "Rút toàn bộ lực lượng về nông thôn.",
          "rationale": "Ta vẫn bám trụ chiến đấu trong thành phố một thời gian.",
          "isCorrect": false
        },
        {
          "text": "Sử dụng không quân ném bom.",
          "rationale": "Năm 1945 ta chưa có không quân.",
          "isCorrect": false
        }
      ],
      "hint": "Biến đồ vật trong nhà thành chướng ngại vật trên đường phố, bao vây quân địch."
    },
    {
      "question_number": 9,
      "question": "Sự kiện nào dưới đây diễn ra vào ngày 19-12-1946?",
      "answer_options": [
        {
          "text": "Pháp gửi tối hậu thư đòi ta giao quyền kiểm soát thủ đô.",
          "rationale": "Tối hậu thư gửi ngày 18/12.",
          "isCorrect": false
        },
        {
          "text": "Chủ tịch Hồ Chí Minh ra Lời kêu gọi toàn quốc kháng chiến.",
          "rationale": "SGK trang 42 (Hình 7.3): Đêm 19-12-1946, Chủ tịch Hồ Chí Minh ra Lời kêu gọi toàn quốc kháng chiến, cuộc kháng chiến toàn quốc bùng nổ.",
          "isCorrect": true
        },
        {
          "text": "Quân Pháp đánh chiếm Hải Phòng.",
          "rationale": "Tháng 11/1946.",
          "isCorrect": false
        },
        {
          "text": "Trung ương Đảng ra chỉ thị 'Toàn dân kháng chiến'.",
          "rationale": "Chỉ thị này ra ngày 12/12/1946 (hoặc 22/12 tùy tài liệu chi tiết, nhưng 19/12 gắn liền với Lời kêu gọi của Bác).",
          "isCorrect": false
        }
      ],
      "hint": "Sự kiện đánh dấu sự bùng nổ cuộc kháng chiến chống Pháp trên quy mô cả nước."
    },
    {
      "question_number": 10,
      "question": "Câu thơ 'Sông Lô, Đoan Hùng, Khe Lau... / Giặc Pháp đến đấy thì 'tan xác' thù' nhắc đến chiến thắng nào?",
      "answer_options": [
        {
          "text": "Chiến dịch Biên giới 1950.",
          "rationale": "Biên giới gắn với Đông Khê, Thất Khê.",
          "isCorrect": false
        },
        {
          "text": "Chiến dịch Việt Bắc thu - đông 1947.",
          "rationale": "SGK trang 43 nhắc đến các địa danh Chợ Đồn, Chợ Rã, Đoan Hùng, Khe Lau... nơi ta bẻ gãy gọng kìm của Pháp trong chiến dịch Việt Bắc.",
          "isCorrect": true
        },
        {
          "text": "Chiến dịch Điện Biên Phủ 1954.",
          "rationale": "Gắn với Him Lam, Độc Lập, Mường Thanh.",
          "isCorrect": false
        },
        {
          "text": "Chiến dịch Hòa Bình 1951.",
          "rationale": "Gắn với sông Đà, đường 6.",
          "isCorrect": false
        }
      ],
      "hint": "Chiến dịch mà Pháp muốn chụp bắt cơ quan đầu não của ta tại căn cứ địa."
    },
    {
      "question_number": 11,
      "question": "Hình ảnh Bác Hồ quan sát mặt trận Đông Khê (Hình 7.5, trang 43) gắn liền với chiến dịch nào?",
      "answer_options": [
        {
          "text": "Chiến dịch Việt Bắc thu - đông 1947.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Chiến dịch Biên giới thu - đông 1950.",
          "rationale": "Hình 7.5 chú thích: Chủ tịch Hồ Chí Minh trên đài quan sát mặt trận Đông Khê (năm 1950).",
          "isCorrect": true
        },
        {
          "text": "Chiến dịch Điện Biên Phủ 1954.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "Chiến dịch Thượng Lào 1953.",
          "rationale": "Sai.",
          "isCorrect": false
        }
      ],
      "hint": "Chiến dịch mà lần đầu tiên và duy nhất Bác Hồ trực tiếp ra mặt trận chỉ đạo."
    },
    {
      "question_number": 12,
      "question": "Nội dung nào KHÔNG phải là nhiệm vụ cơ bản của Đại hội đại biểu lần thứ II của Đảng (1951)?",
      "answer_options": [
        {
          "text": "Đưa Đảng ra hoạt động công khai.",
          "rationale": "Đúng, lấy tên Đảng Lao động Việt Nam.",
          "isCorrect": false
        },
        {
          "text": "Thông qua Tuyên ngôn Độc lập.",
          "rationale": "Sai. Tuyên ngôn Độc lập đã được thông qua và đọc từ năm 1945. Đại hội II thông qua Chính cương, Điều lệ mới.",
          "isCorrect": true
        },
        {
          "text": "Quyết định tách Đảng Cộng sản Đông Dương để thành lập ở mỗi nước một Đảng riêng.",
          "rationale": "Đúng, để phù hợp với đặc điểm mỗi nước.",
          "isCorrect": false
        },
        {
          "text": "Bầu Ban Chấp hành Trung ương mới do Hồ Chí Minh làm Chủ tịch.",
          "rationale": "Đúng.",
          "isCorrect": false
        }
      ],
      "hint": "Một văn kiện đã hoàn thành sứ mệnh lịch sử từ năm 1945."
    },
    {
      "question_number": 13,
      "question": "Theo SGK trang 44, Mỹ đã làm gì để hỗ trợ Pháp trong kế hoạch Na-va?",
      "answer_options": [
        {
          "text": "Trực tiếp đưa quân đội Mỹ vào tham chiến.",
          "rationale": "Mỹ chưa đưa quân chiến đấu trực tiếp (bộ binh) vào giai đoạn này.",
          "isCorrect": false
        },
        {
          "text": "Tăng cường viện trợ quân sự và cố vấn.",
          "rationale": "Mỹ chi trả phần lớn chiến phí cho Pháp ở Đông Dương thông qua viện trợ để thực hiện kế hoạch Na-va.",
          "isCorrect": true
        },
        {
          "text": "Ký hiệp ước phòng thủ chung với Pháp.",
          "rationale": "Không phải nội dung chính được đề cập trong bối cảnh Kế hoạch Na-va.",
          "isCorrect": false
        },
        {
          "text": "Yêu cầu Pháp rút quân ngay lập tức.",
          "rationale": "Mỹ muốn Pháp tiếp tục đánh để ngăn chặn cộng sản.",
          "isCorrect": false
        }
      ],
      "hint": "Pháp thực hiện kế hoạch Na-va bằng tiền và vũ khí của nước nào?"
    },
    {
      "question_number": 14,
      "question": "Chiến dịch Điện Biên Phủ (1954) được chia làm mấy đợt tấn công?",
      "answer_options": [
        {
          "text": "2 đợt.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "3 đợt.",
          "rationale": "SGK trang 45: 'mở chiến dịch Điện Biên Phủ. Trải qua 3 đợt tiến công...'.",
          "isCorrect": true
        },
        {
          "text": "4 đợt.",
          "rationale": "Sai.",
          "isCorrect": false
        },
        {
          "text": "5 đợt.",
          "rationale": "Sai.",
          "isCorrect": false
        }
      ],
      "hint": "Bắt đầu từ 13/3 và kết thúc vào 7/5."
    },
    {
      "question_number": 15,
      "question": "Câu nói nổi tiếng của Chủ tịch Hồ Chí Minh trong Lời kêu gọi toàn quốc kháng chiến: 'Ai có súng dùng súng. Ai có gươm dùng gươm...' thể hiện quan điểm gì?",
      "answer_options": [
        {
          "text": "Kháng chiến toàn diện.",
          "rationale": "Toàn diện là trên mọi mặt trận (kinh tế, văn hóa...).",
          "isCorrect": false
        },
        {
          "text": "Kháng chiến toàn dân.",
          "rationale": "Mọi người dân, bất kể già trẻ gái trai, đều tham gia đánh giặc bằng mọi vũ khí có trong tay.",
          "isCorrect": true
        },
        {
          "text": "Kháng chiến trường kì.",
          "rationale": "Trường kì là đánh lâu dài.",
          "isCorrect": false
        },
        {
          "text": "Tự lực cánh sinh.",
          "rationale": "Tự lực là dựa vào sức mình.",
          "isCorrect": false
        }
      ],
      "hint": "Huy động sức mạnh của mọi tầng lớp nhân dân."
    },
    {
      "question_number": 16,
      "question": "Phát biểu nào sau đây là ĐÚNG về kết quả của Hiệp định Giơ-ne-vơ năm 1954?",
      "answer_options": [
        {
          "text": "Nước Việt Nam được thống nhất ngay lập tức.",
          "rationale": "Bị chia cắt tạm thời tại vĩ tuyến 17.",
          "isCorrect": false
        },
        {
          "text": "Pháp công nhận độc lập, chủ quyền, thống nhất và toàn vẹn lãnh thổ của ba nước Đông Dương.",
          "rationale": "SGK trang 46: Pháp buộc phải chấm dứt chiến tranh, rút quân... cam kết tôn trọng các quyền dân tộc cơ bản.",
          "isCorrect": true
        },
        {
          "text": "Quân đội Mỹ thay thế quân đội Pháp đóng quân ở miền Bắc.",
          "rationale": "Mỹ nhảy vào miền Nam, miền Bắc hoàn toàn giải phóng.",
          "isCorrect": false
        },
        {
          "text": "Lào và Campuchia vẫn thuộc quyền cai trị của Pháp.",
          "rationale": "Pháp công nhận độc lập của cả 3 nước.",
          "isCorrect": false
        }
      ],
      "hint": "Nội dung pháp lý quan trọng nhất của Hiệp định."
    },
    {
      "question_number": 17,
      "question": "Ý nghĩa quốc tế của chiến thắng Điện Biên Phủ là gì?",
      "answer_options": [
        {
          "text": "Làm lung lay hệ thống thuộc địa của chủ nghĩa thực dân cũ trên thế giới.",
          "rationale": "SGK trang 45: 'cổ vũ các dân tộc thuộc địa... chứng minh chân lí... làm lung lay tận gốc hệ thống thuộc địa'.",
          "isCorrect": true
        },
        {
          "text": "Kết thúc hoàn toàn chủ nghĩa thực dân mới của Mỹ.",
          "rationale": "Chủ nghĩa thực dân mới của Mỹ lúc này mới bắt đầu.",
          "isCorrect": false
        },
        {
          "text": "Giúp Việt Nam gia nhập ASEAN ngay lập tức.",
          "rationale": "Việt Nam gia nhập ASEAN năm 1995.",
          "isCorrect": false
        },
        {
          "text": "Mở ra kỷ nguyên toàn cầu hóa.",
          "rationale": "Không liên quan trực tiếp.",
          "isCorrect": false
        }
      ],
      "hint": "Chiến thắng này là nguồn cảm hứng cho các dân tộc ở châu Á, Phi và Mỹ Latinh."
    },
    {
      "question_number": 18,
      "question": "Nhận định nào sau đây là SAI về tình hình Việt Nam sau ngày 2/9/1945?",
      "answer_options": [
        {
          "text": "Chính quyền cách mạng non trẻ đối mặt với muôn vàn khó khăn.",
          "rationale": "Đúng (giặc đói, giặc dốt, giặc ngoại xâm).",
          "isCorrect": false
        },
        {
          "text": "Nền kinh tế kiệt quệ, nạn đói hoành hành.",
          "rationale": "Đúng.",
          "isCorrect": false
        },
        {
          "text": "Việt Nam đã được tất cả các nước trên thế giới công nhận và đặt quan hệ ngoại giao.",
          "rationale": "Sai. Lúc này ta đang bị bao vây, chưa có nước nào công nhận chính thức ngay năm 1945 (phải đến 1950 mới có TQ, LX công nhận).",
          "isCorrect": true
        },
        {
          "text": "Quân đội các nước đế quốc (Anh, Tưởng, Pháp) dồn dập kéo vào.",
          "rationale": "Đúng.",
          "isCorrect": false
        }
      ],
      "hint": "Về mặt ngoại giao, nước ta lúc đó đang trong tình thế 'đơn thương độc mã'."
    },
    {
        "question_number": 19,
        "question": "Để thực hiện kế hoạch Na-va (1953), thực dân Pháp đã tập trung xây dựng lực lượng nào để hòng giành lại thế chủ động?",
        "answer_options": [
          {
            "text": "Lực lượng phòng ngự biên giới.",
            "rationale": "Đây là tư duy cũ của kế hoạch Rơ-ve.",
            "isCorrect": false
          },
          {
            "text": "Khối cơ động chiến lược mạnh.",
            "rationale": "SGK trang 44: Na-va hi vọng giành thắng lợi bằng cách 'xin Mỹ tăng viện trợ quân sự, tăng thêm quân ngụy, tập trung xây dựng khối cơ động chiến lược mạnh'.",
            "isCorrect": true
          },
          {
            "text": "Hệ thống đồn bốt dày đặc ở nông thôn.",
            "rationale": "Na-va tập trung quân cơ động chứ không phân tán quá mức vào đồn bốt tĩnh.",
            "isCorrect": false
          },
          {
            "text": "Lực lượng không quân chiến lược.",
            "rationale": "Pháp phụ thuộc vào Mỹ về không quân, nhưng trọng tâm xây dựng của Na-va là các binh đoàn cơ động.",
            "isCorrect": false
          }
        ],
        "hint": "Muốn 'đánh nhanh' và 'chủ động', Pháp cần một lực lượng có khả năng di chuyển linh hoạt và mạnh mẽ (quả đấm thép)."
    },
    {
      "question_number": 20,
      "question": "Ai là người đã lấy thân mình lấp lỗ châu mai trong chiến dịch Biên giới 1950?",
      "answer_options": [
        {
          "text": "Phan Đình Giót.",
          "rationale": "Lấp lỗ châu mai ở Điện Biên Phủ (1954).",
          "isCorrect": false
        },
        {
          "text": "Trần Can.",
          "rationale": "Anh hùng Điện Biên Phủ.",
          "isCorrect": false
        },
        {
          "text": "La Văn Cầu.",
          "rationale": "Chặt cánh tay phá đồn địch ở Đông Khê (Biên giới 1950).",
          "isCorrect": false
        },
        {
          "text": "Trần Cừ.",
          "rationale": "Trong danh sách 7 anh hùng tuyên dương năm 1952, Trần Cừ được biết đến với hành động lấy thân mình lấp lỗ châu mai trong chiến dịch Biên giới (trận Đông Khê). Lưu ý: Phan Đình Giót lấp lỗ châu mai ở Him Lam (Điện Biên Phủ) sau này. Sách trang 43 liệt kê Trần Cừ là anh hùng.",
          "isCorrect": true
        }
      ],
      "hint": "Một trong 7 anh hùng được tuyên dương tại Đại hội Chiến sĩ thi đua lần thứ I (1952)."
    },
    {
      "question_number": 21,
      "question": "Nội dung nào là biểu hiện của quy luật 'vừa kháng chiến vừa kiến quốc' trong giai đoạn 1945-1954?",
      "answer_options": [
        {
          "text": "Chỉ tập trung đánh giặc ngoài mặt trận.",
          "rationale": "Thiếu phần kiến quốc.",
          "isCorrect": false
        },
        {
          "text": "Vừa chiến đấu chống Pháp, vừa xây dựng chế độ mới, kinh tế, văn hóa, giáo dục ở hậu phương.",
          "rationale": "Thể hiện rõ ở việc bầu cử Quốc hội, xóa nạn mù chữ, tăng gia sản xuất ngay trong khi đánh giặc.",
          "isCorrect": true
        },
        {
          "text": "Xây dựng đất nước xong mới đánh giặc.",
          "rationale": "Không thể chờ đợi.",
          "isCorrect": false
        },
        {
          "text": "Nhờ nước ngoài xây dựng đất nước hộ.",
          "rationale": "Sai quan điểm tự lực.",
          "isCorrect": false
        }
      ],
      "hint": "Xây dựng hậu phương vững mạnh để chi viện cho tiền tuyến."
    },
    {
      "question_number": 22,
      "question": "Chiến dịch nào được coi là 'bước ngoặt vĩ đại' của cuộc kháng chiến chống Pháp?",
      "answer_options": [
        {
          "text": "Chiến dịch Việt Bắc 1947.",
          "rationale": "Là chiến dịch phản công bảo vệ căn cứ.",
          "isCorrect": false
        },
        {
          "text": "Chiến dịch Biên giới thu - đông 1950.",
          "rationale": "SGK trang 43: Mở ra bước phát triển mới (bước ngoặt) - ta giành quyền chủ động chiến lược.",
          "isCorrect": true
        },
        {
          "text": "Chiến dịch Điện Biên Phủ 1954.",
          "rationale": "Là chiến thắng quyết định kết thúc chiến tranh.",
          "isCorrect": false
        },
        {
          "text": "Cuộc tiến công Đông Xuân 1953-1954.",
          "rationale": "Là giai đoạn giữ vững quyền chủ động.",
          "isCorrect": false
        }
      ],
      "hint": "Chiến dịch khai thông con đường liên lạc quốc tế và chuyển cuộc kháng chiến sang giai đoạn mới."
    },
    {
      "question_number": 23,
      "question": "Phương châm tác chiến 'Đánh chắc, tiến chắc' tại Điện Biên Phủ đã thay thế cho phương châm nào trước đó?",
      "answer_options": [
        {
          "text": "Đánh nhanh, thắng nhanh.",
          "rationale": "Do địch tăng cường phòng ngự quá mạnh, ta không thể đánh nhanh thắng nhanh như dự kiến ban đầu.",
          "isCorrect": true
        },
        {
          "text": "Đánh du kích.",
          "rationale": "Không phải phương châm cấp chiến dịch tại ĐBP.",
          "isCorrect": false
        },
        {
          "text": "Vừa đánh vừa đàm.",
          "rationale": "Là sách lược ngoại giao.",
          "isCorrect": false
        },
        {
          "text": "Phòng ngự chiều sâu.",
          "rationale": "Là cách đánh của địch.",
          "isCorrect": false
        }
      ],
      "hint": "Quyết định khó khăn nhất trong cuộc đời chỉ huy của Đại tướng Võ Nguyên Giáp."
    },
    {
      "question_number": 24,
      "question": "Hình 7.4 (trang 40) 'Chiến sĩ vệ quốc quân chiến đấu giữ từng căn nhà...' phản ánh cuộc chiến đấu ở đâu?",
      "answer_options": [
        {
          "text": "Chiến khu Việt Bắc.",
          "rationale": "Đây là rừng núi.",
          "isCorrect": false
        },
        {
          "text": "Các đô thị phía Bắc vĩ tuyến 16 (đặc biệt là Hà Nội).",
          "rationale": "Cuộc chiến đấu giam chân địch trong thành phố (60 ngày đêm khói lửa Hà Nội).",
          "isCorrect": true
        },
        {
          "text": "Mặt trận Sài Gòn.",
          "rationale": "Diễn ra năm 1945.",
          "isCorrect": false
        },
        {
          "text": "Mặt trận Điện Biên Phủ.",
          "rationale": "Diễn ra ở lòng chảo, đồi núi.",
          "isCorrect": false
        }
      ],
      "hint": "Nơi có những chiến lũy dựng bằng bàn ghế, giường tủ trên đường phố."
    },
    {
      "question_number": 25,
      "question": "Chính cương Đảng Lao động Việt Nam (thông qua tại Đại hội II năm 1951) nêu rõ nhiệm vụ cơ bản của cách mạng Việt Nam là gì?",
      "answer_options": [
        {
          "text": "Đánh đuổi đế quốc xâm lược, giành độc lập và thống nhất hoàn toàn.",
          "rationale": "SGK trang 43: 'Đánh đuổi bọn đế quốc xâm lược, giành độc lập và thống nhất hoàn toàn cho dân tộc...'.",
          "isCorrect": true
        },
        {
          "text": "Xây dựng chủ nghĩa xã hội ngay lập tức.",
          "rationale": "Chưa phải lúc.",
          "isCorrect": false
        },
        {
          "text": "Thực hiện cách mạng ruộng đất triệt để.",
          "rationale": "Là nhiệm vụ quan trọng nhưng mục tiêu hàng đầu là giải phóng dân tộc.",
          "isCorrect": false
        },
        {
          "text": "Hợp tác với Pháp để chống Mỹ.",
          "rationale": "Sai.",
          "isCorrect": false
        }
      ],
      "hint": "Nhiệm vụ dân tộc được đặt lên hàng đầu."
    }
  ]
}



