{
  "questions": [
    {
      "question_number": 1,
      "question": "Trong cơ chế nhân đôi ADN, enzyme ADN polymerase tổng hợp mạch mới theo chiều nào?",
      "answer_options": [
        {"text": "3’ → 5’", "rationale": "Sai. Đây là chiều mà enzyme ADN polymerase di chuyển trên mạch khuôn.", "isCorrect": false},
        {"text": "5’ → 3’", "rationale": "Đúng. Enzyme ADN polymerase chỉ có thể lắp ráp các nucleotide mới vào đầu 3’ của mạch đang được tổng hợp, do đó mạch mới luôn được kéo dài theo chiều 5’ → 3’.", "isCorrect": true},
        {"text": "Cả hai chiều", "rationale": "Sai. Enzyme này có chiều tổng hợp rất đặc hiệu.", "isCorrect": false},
        {"text": "Từ giữa ra hai bên", "rationale": "Sai. Đây là mô tả hướng lan rộng của chạc tái bản, không phải chiều tổng hợp hóa học của mạch polinucleotide.", "isCorrect": false}
      ],
      "hint": "Đây là một quy tắc cơ bản và không đổi cho tất cả các quá trình tổng hợp axit nucleic."
    },
    {
      "question_number": 2,
      "question": "Chọn phát biểu sai khi nói về cấu trúc của gen ở sinh vật nhân thực.",
      "answer_options": [
        {"text": "Vùng mã hóa chứa các đoạn exon mã hóa xen kẽ với các đoạn intron không mã hóa.", "rationale": "Đây là phát biểu đúng, mô tả cấu trúc phân mảnh đặc trưng của gen nhân thực.", "isCorrect": false},
        {"text": "Vùng điều hòa nằm ở đầu 3’ của mạch mã gốc, có vai trò điều khiển phiên mã.", "rationale": "Đây là phát biểu đúng về vị trí và chức năng của vùng điều hòa.", "isCorrect": false},
        {"text": "Toàn bộ thông tin trên gen đều được dịch mã thành protein.", "rationale": "Đây là phát biểu sai. Các đoạn intron trong vùng mã hóa và cả vùng điều hòa, vùng kết thúc đều không được dịch mã. Sau phiên mã, các intron còn bị cắt bỏ khỏi mARN sơ khai.", "isCorrect": true},
        {"text": "Vùng kết thúc nằm ở đầu 5’ của mạch mã gốc, mang tín hiệu kết thúc phiên mã.", "rationale": "Đây là phát biểu đúng về vị trí và chức năng của vùng kết thúc.", "isCorrect": false}
      ],
      "hint": "Hãy xem xét quá trình từ gen -> mARN trưởng thành -> protein ở sinh vật nhân thực. Có phải tất cả các phần của gen đều được giữ lại không?"
    },
    {
      "question_number": 3,
      "question": "Quá trình dịch mã không có sự tham gia trực tiếp của thành phần nào sau đây?",
      "answer_options": [
        {"text": "mARN", "rationale": "Sai. mARN là khuôn mẫu trực tiếp cho quá trình dịch mã.", "isCorrect": false},
        {"text": "Ribosome", "rationale": "Sai. Ribosome là 'nhà máy' tổng hợp protein, nơi diễn ra dịch mã.", "isCorrect": false},
        {"text": "tARN", "rationale": "Sai. tARN có vai trò vận chuyển các axit amin tương ứng đến ribosome.", "isCorrect": false},
        {"text": "ADN", "rationale": "Đúng. ADN chứa gen gốc nhưng nó không tham gia trực tiếp vào quá trình dịch mã. Dịch mã diễn ra ở tế bào chất và sử dụng khuôn là mARN.", "isCorrect": true}
      ],
      "hint": "Dịch mã là quá trình tổng hợp protein. Quá trình này diễn ra ở đâu trong tế bào và cần những 'nguyên liệu' và 'bộ máy' nào?"
    },
    {
      "question_number": 4,
      "question": "Trong cơ chế điều hòa của operon Lac, vai trò của protein ức chế là gì?",
      "answer_options": [
        {"text": "Khởi động quá trình phiên mã.", "rationale": "Sai. Vai trò này thuộc về ARN polymerase khi tương tác với vùng khởi động.", "isCorrect": false},
        {"text": "Vận chuyển lactose vào tế bào.", "rationale": "Sai. Vai trò này thuộc về sản phẩm của gen cấu trúc lacY (enzyme permease).", "isCorrect": false},
        {"text": "Ngăn cản quá trình phiên mã khi môi trường không có lactose.", "rationale": "Đúng. Protein ức chế liên kết với vùng vận hành (O), ngăn không cho ARN polymerase di chuyển để phiên mã các gen cấu trúc.", "isCorrect": true},
        {"text": "Phân giải lactose thành glucose và galactose.", "rationale": "Sai. Vai trò này thuộc về sản phẩm của gen cấu trúc lacZ (enzyme β-galactosidase).", "isCorrect": false}
      ],
      "hint": "Tên gọi 'protein ức chế' đã nói lên chức năng chính của nó."
    },
    {
      "question_number": 5,
      "question": "Loại đột biến gen nào sau đây được gọi là đột biến vô nghĩa (nonsense mutation)?",
      "answer_options": [
        {"text": "Đột biến làm thay thế một axit amin này bằng một axit amin khác.", "rationale": "Sai. Đây là đột biến sai nghĩa (missense).", "isCorrect": false},
        {"text": "Đột biến không làm thay đổi trình tự axit amin.", "rationale": "Sai. Đây là đột biến đồng nghĩa (silent).", "isCorrect": false},
        {"text": "Đột biến làm một bộ ba mã hóa axit amin biến thành bộ ba kết thúc.", "rationale": "Đúng. Đột biến này làm cho quá trình dịch mã dừng lại sớm, tạo ra chuỗi polypeptide ngắn hơn và thường mất chức năng.", "isCorrect": true},
        {"text": "Đột biến làm thay đổi khung đọc của gen từ vị trí đột biến.", "rationale": "Sai. Đây là đột biến dịch khung (frameshift).", "isCorrect": false}
      ],
      "hint": "Hãy nghĩ về ý nghĩa của từ 'vô nghĩa' trong bối cảnh tổng hợp protein. Điều gì sẽ xảy ra nếu quá trình bị dừng lại đột ngột?"
    },
    {
      "question_number": 6,
      "question": "Thể song nhị bội là cơ thể có tế bào mang:",
      "answer_options": [
        {"text": "Bộ NST lưỡng bội của một loài.", "rationale": "Sai. Đây là cơ thể lưỡng bội bình thường.", "isCorrect": false},
        {"text": "Bộ NST tam bội của một loài.", "rationale": "Sai. Đây là thể tự tam bội.", "isCorrect": false},
        {"text": "Bộ NST lưỡng bội của hai loài khác nhau.", "rationale": "Đúng. Thể song nhị bội được hình thành do lai xa giữa hai loài khác nhau, sau đó đa bội hóa con lai, tạo ra cơ thể mang bộ NST lưỡng bội (2n) của cả hai loài bố mẹ.", "isCorrect": true},
        {"text": "Một cặp NST có 3 chiếc, các cặp còn lại bình thường.", "rationale": "Sai. Đây là thể ba, một dạng lệch bội.", "isCorrect": false}
      ],
      "hint": "Phân tích thuật ngữ: 'song' nghĩa là hai, 'nhị bội' nghĩa là bộ lưỡng bội (2n)."
    },
    {
      "question_number": 7,
      "question": "Cho các sự kiện sau về quá trình nhân đôi ADN:\n(1) Enzyme ligase nối các đoạn Okazaki.\n(2) Enzyme helicase tháo xoắn ADN.\n(3) Enzyme ADN polymerase tổng hợp các mạch mới.\n(4) Hai phân tử ADN con được tạo thành.\n(5) Enzyme ARN polymerase tổng hợp đoạn mồi.\nTrật tự đúng của các sự kiện là:",
      "answer_options": [
        {"text": "2 → 5 → 3 → 1 → 4", "rationale": "Đúng. Đầu tiên ADN phải tháo xoắn (2), sau đó các đoạn mồi được tổng hợp (5) để ADN polymerase có thể bắt đầu tổng hợp mạch mới (3). Trên mạch gián đoạn, các đoạn Okazaki được nối lại (1), và cuối cùng hai ADN con hoàn chỉnh được hình thành (4).", "isCorrect": true},
        {"text": "2 → 3 → 5 → 1 → 4", "rationale": "Sai. Cần có đoạn mồi (5) trước khi ADN polymerase (3) có thể hoạt động.", "isCorrect": false},
        {"text": "5 → 2 → 3 → 1 → 4", "rationale": "Sai. Phải tháo xoắn (2) trước thì mới có mạch khuôn để tổng hợp mồi (5).", "isCorrect": false},
        {"text": "2 → 5 → 1 → 3 → 4", "rationale": "Sai. Phải tổng hợp các đoạn (3) rồi mới có thể nối chúng lại (1).", "isCorrect": false}
      ],
      "hint": "Hãy sắp xếp các bước theo trình tự logic của một quá trình 'xây dựng', từ khâu 'mở móng' đến 'hoàn thiện'."
    },
    {
      "question_number": 8,
      "question": "Ở cà chua, gen A quy định quả đỏ trội hoàn toàn so với alen a quy định quả vàng. Cây tứ bội (4n) có kiểu gen Aaaa khi giảm phân sẽ tạo ra các loại giao tử với tỉ lệ nào?",
      "answer_options": [
        {"text": "1 AA : 1 aa", "rationale": "Sai. Cây Aaaa có cả alen A và a, sẽ tạo ra giao tử chứa cả hai loại alen này.", "isCorrect": false},
        {"text": "1 A : 1 a", "rationale": "Sai. Đây là tỉ lệ giao tử của cây lưỡng bội dị hợp Aa. Cây tứ bội tạo ra giao tử lưỡng bội (2n).", "isCorrect": false},
        {"text": "1 AA : 4 Aa : 1 aa", "rationale": "Sai. Tỉ lệ này không đúng. Tỉ lệ giao tử của cây Aaaa là 3Aa : 3aa, rút gọn là 1Aa : 1aa. Hoặc chính xác hơn là 1/2 Aa và 1/2 aa.", "isCorrect": false},
        {"text": "1 Aa : 1 aa", "rationale": "Đúng. Cây tứ bội Aaaa khi giảm phân tạo ra 2 loại giao tử lưỡng bội là Aa và aa với tỉ lệ bằng nhau (1/2 Aa : 1/2 aa), rút gọn là 1 : 1.", "isCorrect": true}
      ],
      "hint": "Vẽ hình chữ nhật hoặc sử dụng quy tắc phân chia để xác định các loại giao tử lưỡng bội (2n) được tạo ra từ cơ thể 4n. Kiểu gen Aaaa có 1 alen A và 3 alen a."
    },
    {
      "question_number": 9,
      "question": "Thành tựu nào sau đây được tạo ra bằng phương pháp gây đột biến?",
      "answer_options": [
        {"text": "Cừu Dolly", "rationale": "Sai. Đây là thành tựu của công nghệ tế bào (nhân bản vô tính).", "isCorrect": false},
        {"text": "Giống lúa 'gạo vàng'", "rationale": "Sai. Đây là thành tựu của công nghệ gen (chuyển gen).", "isCorrect": false},
        {"text": "Nhiều chủng vi sinh vật có năng suất hoạt tính cao (ví dụ: nấm Penicillium).", "rationale": "Đúng. Gây đột biến bằng các tác nhân vật lý, hóa học là phương pháp rất hiệu quả để tạo ra các chủng vi sinh vật có đặc tính mong muốn (như sản xuất nhiều kháng sinh, enzyme...).", "isCorrect": true},
        {"text": "Cây pomato (cây lai giữa khoai tây và cà chua).", "rationale": "Sai. Đây là thành tựu của công nghệ tế bào (dung hợp tế bào trần).", "isCorrect": false}
      ],
      "hint": "Phương pháp gây đột biến thường được áp dụng hiệu quả trên đối tượng nào có tốc độ sinh sản nhanh và số lượng lớn?"
    },
    {
      "question_number": 10,
      "question": "Cơ sở vật chất di truyền ở cấp độ phân tử là gì?",
      "answer_options": [
        {"text": "Nhiễm sắc thể", "rationale": "Sai. Nhiễm sắc thể là cơ sở vật chất di truyền ở cấp độ tế bào.", "isCorrect": false},
        {"text": "Axit nucleic (ADN và ARN)", "rationale": "Đúng. Axit nucleic, đặc biệt là ADN, là phân tử mang thông tin di truyền, quy định mọi hoạt động sống của tế bào.", "isCorrect": true},
        {"text": "Protein", "rationale": "Sai. Protein là sản phẩm của gen, thực hiện chức năng để biểu hiện tính trạng, không phải là vật chất mang thông tin di truyền gốc.", "isCorrect": false},
        {"text": "Tế bào", "rationale": "Sai. Tế bào là đơn vị cấu trúc và chức năng của cơ thể sống.", "isCorrect": false}
      ],
      "hint": "Thông tin di truyền được mã hóa trong cấu trúc của phân tử nào?"
    },
    {
      "question_number": 11,
      "question": "Dạng đột biến cấu trúc NST nào thường được ứng dụng để loại bỏ những gen không mong muốn ra khỏi giống?",
      "answer_options": [
        {"text": "Lặp đoạn", "rationale": "Sai. Lặp đoạn làm tăng số lượng gen.", "isCorrect": false},
        {"text": "Đảo đoạn", "rationale": "Sai. Đảo đoạn chỉ thay đổi vị trí gen.", "isCorrect": false},
        {"text": "Mất đoạn nhỏ", "rationale": "Đúng. Bằng cách gây đột biến mất đoạn nhỏ có chủ đích, các nhà khoa học có thể loại bỏ một hoặc một vài gen có hại ra khỏi bộ gen của cây trồng hoặc vật nuôi.", "isCorrect": true},
        {"text": "Chuyển đoạn", "rationale": "Sai. Chuyển đoạn dùng để chuyển gen từ loài này sang loài khác.", "isCorrect": false}
      ],
      "hint": "Để 'xóa' một gen, ta cần sử dụng dạng đột biến nào?"
    },
    {
      "question_number": 12,
      "question": "Quá trình tự nhân đôi của ADN ở vi khuẩn E.coli và ở người giống nhau ở điểm nào?",
      "answer_options": [
        {"text": "Số lượng điểm khởi đầu nhân đôi.", "rationale": "Sai. Vi khuẩn chỉ có 1 điểm, người có nhiều điểm.", "isCorrect": false},
        {"text": "Tốc độ nhân đôi.", "rationale": "Sai. Tốc độ nhân đôi ở vi khuẩn nhanh hơn ở người.", "isCorrect": false},
        {"text": "Kích thước của đơn vị tái bản.", "rationale": "Sai. Đơn vị tái bản ở vi khuẩn lớn (bằng cả phân tử ADN), ở người thì nhỏ hơn.", "isCorrect": false},
        {"text": "Nguyên tắc bán bảo tồn.", "rationale": "Đúng. Nguyên tắc bán bảo tồn (mỗi ADN con gồm một mạch cũ và một mạch mới) là nguyên tắc chung cho sự nhân đôi ADN ở mọi loài sinh vật.", "isCorrect": true}
      ],
      "hint": "Hãy tìm một nguyên tắc cơ bản, phổ quát của quá trình nhân đôi ADN."
    },
    {
      "question_number": 13,
      "question": "Có bao nhiêu bộ ba mã hóa cho các axit amin trong tổng số 64 bộ ba của mã di truyền?",
      "answer_options": [
        {"text": "64", "rationale": "Sai. Cần trừ đi các bộ ba không mã hóa axit amin.", "isCorrect": false},
        {"text": "61", "rationale": "Đúng. Trong 64 bộ ba, có 3 bộ ba kết thúc (UAA, UAG, UGA) không mã hóa cho axit amin nào. Do đó, số bộ ba mã hóa là 64 - 3 = 61.", "isCorrect": true},
        {"text": "20", "rationale": "Sai. 20 là số loại axit amin phổ biến được mã hóa.", "isCorrect": false},
        {"text": "60", "rationale": "Sai. Số bộ ba kết thúc là 3.", "isCorrect": false}
      ],
      "hint": "Hãy nhớ lại có bao nhiêu bộ ba làm nhiệm vụ 'bắt đầu' và bao nhiêu bộ ba làm nhiệm vụ 'kết thúc'."
    },
    {
      "question_number": 14,
      "question": "Trong trường hợp nào thì operon Lac hoạt động mạnh nhất?",
      "answer_options": [
        {"text": "Môi trường có lactose và không có glucose.", "rationale": "Đúng. Khi có lactose, protein ức chế bị bất hoạt. Khi không có glucose, nồng độ cAMP tăng cao, phức hợp CAP-cAMP được tạo thành và liên kết với vùng P, làm tăng cường phiên mã lên mức tối đa.", "isCorrect": true},
        {"text": "Môi trường có lactose và có glucose.", "rationale": "Sai. Khi có glucose, nồng độ cAMP thấp, phức hợp CAP-cAMP không được tạo thành, do đó phiên mã diễn ra ở mức độ thấp.", "isCorrect": false},
        {"text": "Môi trường không có lactose và không có glucose.", "rationale": "Sai. Nếu không có lactose, protein ức chế sẽ bám vào vùng O và ngăn cản phiên mã, bất kể có glucose hay không.", "isCorrect": false},
        {"text": "Môi trường không có lactose và có glucose.", "rationale": "Sai. Không có lactose thì operon bị ức chế.", "isCorrect": false}
      ],
      "hint": "Hoạt động của operon Lac chịu sự điều hòa của cả cơ chế ức chế (liên quan đến lactose) và cơ chế hoạt hóa (liên quan đến glucose)."
    },
    {
      "question_number": 15,
      "question": "Hội chứng Đao (Down) ở người là do có 3 nhiễm sắc thể ở cặp số 21. Đây là hậu quả của đột biến:",
      "answer_options": [
        {"text": "Đa bội thể", "rationale": "Sai. Đa bội là sự thay đổi số lượng ở tất cả các cặp NST.", "isCorrect": false},
        {"text": "Lệch bội thể", "rationale": "Đúng. Đây là đột biến làm thay đổi số lượng ở một cặp nhiễm sắc thể, cụ thể là thể ba (2n+1).", "isCorrect": true},
        {"text": "Cấu trúc NST", "rationale": "Sai. Đây là đột biến về số lượng, không phải cấu trúc.", "isCorrect": false},
        {"text": "Gen", "rationale": "Sai. Đây là đột biến ở cấp độ nhiễm sắc thể.", "isCorrect": false}
      ],
      "hint": "Sự thay đổi số lượng ở một cặp NST được gọi là gì?"
    },
    {
      "question_number": 16,
      "question": "Cho các nhận định về đột biến gen:\n(1) Đột biến gen luôn có hại cho sinh vật.\n(2) Đột biến gen là nguồn nguyên liệu sơ cấp chủ yếu cho quá trình tiến hóa.\n(3) Đột biến thay thế một cặp nucleotide luôn làm thay đổi một axit amin trong chuỗi polipeptit.\n(4) Mức độ gây hại của alen đột biến phụ thuộc vào môi trường và tổ hợp gen.\nSố nhận định đúng là:",
      "answer_options": [
        {"text": "1", "rationale": "Sai. Có 2 nhận định đúng.", "isCorrect": false},
        {"text": "2", "rationale": "Đúng. (2) đúng, đột biến gen tạo alen mới, là nguồn nguyên liệu sơ cấp. (4) đúng, tính có hại hay có lợi của đột biến mang tính tương đối. (1) sai, đột biến có thể có lợi, có hại hoặc trung tính. (3) sai, do tính thoái hóa của mã di truyền, đột biến thay thế có thể là đột biến đồng nghĩa.", "isCorrect": true},
        {"text": "3", "rationale": "Sai. (1) và (3) sai.", "isCorrect": false},
        {"text": "4", "rationale": "Sai. (1) và (3) sai.", "isCorrect": false}
      ],
      "hint": "Xem xét lại tính chất biểu hiện và vai trò của đột biến gen trong các môi trường và tổ hợp gen khác nhau."
    },
    {
      "question_number": 17,
      "question": "Trong công nghệ gen, mục đích của việc đưa gen đã mã hóa insulin của người vào vi khuẩn E. coli là gì?",
      "answer_options": [
        {"text": "Để nghiên cứu cấu trúc gen insulin của người.", "rationale": "Sai. Có thể nghiên cứu cấu trúc bằng các phương pháp khác, mục đích chính là sản xuất.", "isCorrect": false},
        {"text": "Để tạo ra giống vi khuẩn có khả năng kháng thuốc.", "rationale": "Sai. Gen insulin không liên quan đến khả năng kháng thuốc.", "isCorrect": false},
        {"text": "Để sản xuất insulin với số lượng lớn và giá thành rẻ.", "rationale": "Đúng. Vi khuẩn E. coli sinh sản rất nhanh. Bằng cách sử dụng chúng như những 'nhà máy sinh học', ta có thể sản xuất một lượng lớn protein insulin của người để điều trị bệnh tiểu đường.", "isCorrect": true},
        {"text": "Để làm cho vi khuẩn E. coli có thể tổng hợp được đường glucose.", "rationale": "Sai. Gen insulin điều hòa đường huyết, không tổng hợp glucose.", "isCorrect": false}
      ],
      "hint": "E. coli có ưu điểm gì (tốc độ sinh sản) khiến nó trở thành một 'nhà máy' lý tưởng?"
    },
    {
      "question_number": 18,
      "question": "Mức xoắn cao nhất của nhiễm sắc thể, có thể quan sát rõ nhất dưới kính hiển vi quang học, đạt được ở kì nào của quá trình phân bào?",
      "answer_options": [
        {"text": "Kì trung gian", "rationale": "Sai. Ở kì trung gian, NST ở dạng sợi mảnh, giãn xoắn tối đa để nhân đôi và phiên mã.", "isCorrect": false},
        {"text": "Kì đầu", "rationale": "Sai. Ở kì đầu, NST bắt đầu đóng xoắn nhưng chưa đạt mức cực đại.", "isCorrect": false},
        {"text": "Kì giữa", "rationale": "Đúng. Ở kì giữa, các nhiễm sắc thể kép đóng xoắn cực đại và xếp thành một hàng trên mặt phẳng xích đạo của thoi phân bào. Đây là giai đoạn NST có hình dạng và kích thước đặc trưng nhất.", "isCorrect": true},
        {"text": "Kì sau", "rationale": "Sai. Ở kì sau, các chromatid chị em tách nhau và di chuyển về hai cực, NST bắt đầu giãn xoắn.", "isCorrect": false}
      ],
      "hint": "Hãy nhớ lại hình thái của nhiễm sắc thể qua các kì của nguyên phân."
    },
    {
      "question_number": 19,
      "question": "Một gen có trình tự nucleotide trên mạch mã gốc là 3'-...XXX GGA...-5'. Do đột biến, trình tự này biến thành 3'-...XXA GGA...-5'. Đây là dạng đột biến gen nào?",
      "answer_options": [
        {"text": "Mất một cặp nucleotide G-X", "rationale": "Sai. Chiều dài của đoạn gen không thay đổi, chỉ có trình tự thay đổi.", "isCorrect": false},
        {"text": "Thay thế một cặp G-X bằng một cặp T-A", "rationale": "Đúng. Trên mạch gốc, X đã bị thay thế bằng A. Theo nguyên tắc bổ sung, trên mạch đối diện, G tương ứng sẽ bị thay thế bằng T. Do đó, đây là đột biến thay thế cặp G-X bằng cặp A-T.", "isCorrect": true},
        {"text": "Thêm một cặp nucleotide T-A", "rationale": "Sai. Chiều dài của đoạn gen không thay đổi, nên không phải đột biến thêm.", "isCorrect": false},
        {"text": "Đảo vị trí hai cặp nucleotide", "rationale": "Sai. Chỉ có một cặp nucleotide bị thay đổi, không phải đảo vị trí.", "isCorrect": false}
      ],
      "hint": "So sánh trình tự trước và sau đột biến trên mạch gốc để xác định nucleotide nào đã bị thay đổi. Sau đó, suy ra sự thay đổi trên mạch bổ sung."
    },
    {
      "question_number": 20,
      "question": "Vai trò của enzyme ARN polymerase trong quá trình phiên mã là gì?",
      "answer_options": [
        {"text": "Nối các đoạn Okazaki.", "rationale": "Sai. Đây là vai trò của enzyme ligase trong nhân đôi ADN.", "isCorrect": false},
        {"text": "Tháo xoắn ADN và tổng hợp mạch ARN theo nguyên tắc bổ sung.", "rationale": "Đúng. ARN polymerase vừa có chức năng tháo xoắn một đoạn gen, vừa có chức năng xúc tác cho việc liên kết các ribonucleotide tự do để tạo thành phân tử ARN dựa trên mạch khuôn của gen.", "isCorrect": true},
        {"text": "Vận chuyển axit amin đến ribosome.", "rationale": "Sai. Đây là vai trò của tARN.", "isCorrect": false},
        {"text": "Cắt bỏ các đoạn intron khỏi mARN sơ khai.", "rationale": "Sai. Vai trò này được thực hiện bởi phức hệ spliceosome.", "isCorrect": false}
      ],
      "hint": "Enzyme này là nhân tố trung tâm của quá trình phiên mã, nó thực hiện cả hai công việc chính."
    },
    {
      "question_number": 21,
      "question": "Đột biến lệch bội thường gây ra hậu quả gì cho thể đột biến?",
      "answer_options": [
        {"text": "Tăng khả năng thích nghi với môi trường.", "rationale": "Sai. Hầu hết các trường hợp lệch bội đều gây hại.", "isCorrect": false},
        {"text": "Làm mất cân bằng toàn bộ hệ gen, thường gây giảm sức sống hoặc gây chết.", "rationale": "Đúng. Sự thừa hoặc thiếu một NST sẽ làm thay đổi hàm lượng của hàng trăm hoặc hàng nghìn gen, gây ra sự mất cân bằng nghiêm trọng trong quá trình phát triển của cơ thể.", "isCorrect": true},
        {"text": "Không làm thay đổi kiểu hình của sinh vật.", "rationale": "Sai. Đột biến lệch bội thường gây ra những thay đổi lớn về kiểu hình, tạo thành các hội chứng bệnh lý.", "isCorrect": false},
        {"text": "Chỉ ảnh hưởng đến khả năng sinh sản.", "rationale": "Sai. Nó ảnh hưởng đến rất nhiều tính trạng hình thái và sinh lý, không chỉ riêng sinh sản.", "isCorrect": false}
      ],
      "hint": "Hãy nghĩ về hậu quả của việc thừa hoặc thiếu một cuốn sách trong một bộ sách hướng dẫn lắp ráp phức tạp."
    },
    {
      "question_number": 22,
      "question": "Sự kiện nào sau đây là ứng dụng của kĩ thuật di truyền trong y học?",
      "answer_options": [
        {"text": "Sản xuất hormone sinh trưởng của người bằng vi khuẩn E. coli.", "rationale": "Đúng. Bằng cách chuyển gen mã hóa hormone sinh trưởng người vào E. coli, người ta có thể sản xuất lượng lớn hormone này để điều trị bệnh còi xương ở trẻ em.", "isCorrect": true},
        {"text": "Chẩn đoán sớm bệnh ung thư bằng xét nghiệm máu.", "rationale": "Sai. Mặc dù kĩ thuật di truyền (như PCR) được dùng để hỗ trợ chẩn đoán, nhưng bản thân việc xét nghiệm máu không phải là một ứng dụng sản xuất của công nghệ gen.", "isCorrect": false},
        {"text": "Sử dụng kĩ thuật mổ nội soi.", "rationale": "Sai. Đây là một kĩ thuật y học, không phải kĩ thuật di truyền.", "isCorrect": false},
        {"text": "Sản xuất vaccine bất hoạt bằng cách làm yếu virus.", "rationale": "Sai. Đây là phương pháp sản xuất vaccine truyền thống. Vaccine tái tổ hợp mới là ứng dụng của công nghệ gen.", "isCorrect": false}
      ],
      "hint": "Kĩ thuật di truyền trong y học thường liên quan đến việc sản xuất các loại thuốc (protein, hormone) hoặc chẩn đoán bệnh ở cấp độ gen."
    },
    {
      "question_number": 23,
      "question": "Chọn phát biểu đúng về cơ chế phát sinh thể tự đa bội.",
      "answer_options": [
        {"text": "Do sự kết hợp giữa giao tử lưỡng bội (2n) và giao tử đơn bội (n).", "rationale": "Đúng. Sự kết hợp này tạo ra hợp tử tam bội (3n), một dạng của thể tự đa bội lẻ.", "isCorrect": true},
        {"text": "Do sự kết hợp giữa hai loại giao tử (n) của hai loài khác nhau.", "rationale": "Sai. Đây là bước đầu của quá trình tạo thể dị đa bội.", "isCorrect": false},
        {"text": "Do sự không phân li của một cặp NST trong giảm phân.", "rationale": "Sai. Đây là cơ chế phát sinh thể lệch bội (ví dụ: thể ba, thể một).", "isCorrect": false},
        {"text": "Do sự rối loạn trong quá trình nhân đôi ADN.", "rationale": "Sai. Sự rối loạn trong quá trình phân li của toàn bộ bộ NST, không phải nhân đôi ADN, mới là nguyên nhân.", "isCorrect": false}
      ],
      "hint": "Thể tự đa bội là sự nhân lên số bộ NST của cùng một loài. Nó có thể xảy ra trong giảm phân (tạo giao tử 2n) hoặc nguyên phân (tạo cành 4n)."
    },
    {
      "question_number": 24,
      "question": "Loại ARN nào mang bộ ba đối mã (anticodon)?",
      "answer_options": [
        {"text": "mARN", "rationale": "Sai. mARN mang các bộ ba mã hóa (codon).", "isCorrect": false},
        {"text": "tARN", "rationale": "Đúng. tARN có một thùy mang bộ ba đối mã, có trình tự bổ sung với codon tương ứng trên mARN, giúp nó nhận biết đúng vị trí để giao axit amin.", "isCorrect": true},
        {"text": "rARN", "rationale": "Sai. rARN là thành phần cấu trúc của ribosome.", "isCorrect": false},
        {"text": "Cả ba loại ARN trên", "rationale": "Sai. Chỉ tARN có anticodon.", "isCorrect": false}
      ],
      "hint": "Phân tử nào đóng vai trò 'phiên dịch', khớp mã trên mARN với axit amin tương ứng?"
    },
    {
      "question_number": 25,
      "question": "Nếu gen Z trong operon Lac bị đột biến vô nghĩa, hậu quả là gì?",
      "answer_options": [
        {"text": "Tất cả các enzyme LacZ, LacY, LacA đều không được tạo ra.", "rationale": "Sai. Quá trình phiên mã vẫn tạo ra một phân tử mARN chung, nhưng dịch mã sẽ bị ảnh hưởng.", "isCorrect": false},
        {"text": "Enzyme β-galactosidase (LacZ) sẽ không được tạo ra hoặc bị bất hoạt, nhưng các enzyme khác vẫn có thể được tạo ra.", "rationale": "Đúng. Đột biến vô nghĩa trên gen Z sẽ làm quá trình dịch mã dừng lại sớm, tạo ra protein LacZ không hoàn chỉnh hoặc không tạo ra. Quá trình dịch mã các gen Y và A phía sau cũng có thể bị ảnh hưởng (hiệu ứng polar), nhưng về nguyên tắc, đột biến chỉ trực tiếp làm hỏng gen Z.", "isCorrect": true},
        {"text": "Protein ức chế không được tạo ra.", "rationale": "Sai. Đột biến ở gen cấu trúc không ảnh hưởng đến gen điều hòa.", "isCorrect": false},
        {"text": "Operon sẽ không bao giờ được phiên mã.", "rationale": "Sai. Đột biến ở gen cấu trúc không ảnh hưởng đến cơ chế điều hòa phiên mã.", "isCorrect": false}
      ],
      "hint": "Đột biến vô nghĩa ảnh hưởng đến quá trình nào (phiên mã hay dịch mã) và ảnh hưởng đến sản phẩm của gen nào?"
    },
    {
      "question_number": 26,
      "question": "Gen là một đoạn của phân tử ADN mang thông tin...",
      "answer_options": [
        {"text": "...mã hóa cho một chuỗi polypeptide hay một phân tử ARN.", "rationale": "Đúng. Đây là định nghĩa hiện đại và đầy đủ nhất về gen. Gen không chỉ mã hóa cho protein (qua chuỗi polypeptide) mà còn mã hóa cho các loại ARN có chức năng như tARN, rARN.", "isCorrect": true},
        {"text": "...quy định cấu trúc của một loại protein.", "rationale": "Sai. Đây là định nghĩa cũ và chưa đầy đủ, vì gen còn mã hóa cho cả các phân tử ARN chức năng.", "isCorrect": false},
        {"text": "...quy định toàn bộ các tính trạng của cơ thể.", "rationale": "Sai. Mỗi gen thường chỉ tham gia quy định một hoặc một vài tính trạng. Toàn bộ tính trạng là do hệ gen quy định.", "isCorrect": false},
        {"text": "...di truyền từ bố mẹ sang con cái.", "rationale": "Sai. Đây là mô tả chức năng của vật chất di truyền nói chung, không phải định nghĩa của một gen.", "isCorrect": false}
      ],
      "hint": "Sản phẩm cuối cùng của một gen có thể là gì?"
    },
    {
      "question_number": 27,
      "question": "Đột biến thể ba ở người có thể gây ra hội chứng nào sau đây?",
      "answer_options": [
        {"text": "Thiếu máu hồng cầu hình liềm", "rationale": "Sai. Đây là bệnh do đột biến gen gây ra.", "isCorrect": false},
        {"text": "Bạch tạng", "rationale": "Sai. Đây là bệnh do đột biến gen lặn gây ra.", "isCorrect": false},
        {"text": "Down (3 NST 21)", "rationale": "Đúng. Hội chứng Down là một ví dụ điển hình của đột biến thể ba (2n+1) ở nhiễm sắc thể thường.", "isCorrect": true},
        {"text": "Máu khó đông", "rationale": "Sai. Đây là bệnh do đột biến gen lặn trên NST giới tính X.", "isCorrect": false}
      ],
      "hint": "Thể ba là dạng đột biến số lượng, thừa 1 chiếc NST. Hãy tìm hội chứng tương ứng."
    },
    {
      "question_number": 28,
      "question": "Cho các nhận xét về quá trình phiên mã, có bao nhiêu nhận xét đúng?\n(1) Enzyme chính tham gia là ARN polymeraza.\n(2) Cả hai mạch của gen đều được dùng làm khuôn.\n(3) Diễn ra theo nguyên tắc bổ sung và bán bảo tồn.\n(4) Ở sinh vật nhân thực, mARN sau phiên mã phải qua giai đoạn chế biến.",
      "answer_options": [
        {"text": "1", "rationale": "Sai. Có 2 nhận xét đúng.", "isCorrect": false},
        {"text": "2", "rationale": "Đúng. (1) đúng. (4) đúng, mARN sơ khai phải cắt bỏ intron để thành mARN trưởng thành. (2) sai, chỉ một mạch của gen (mạch mã gốc) được dùng làm khuôn. (3) sai, phiên mã có nguyên tắc bổ sung nhưng không có nguyên tắc bán bảo tồn.", "isCorrect": true},
        {"text": "3", "rationale": "Sai. (2) và (3) sai.", "isCorrect": false},
        {"text": "4", "rationale": "Sai. (2) và (3) sai.", "isCorrect": false}
      ],
      "hint": "So sánh quá trình phiên mã với quá trình nhân đôi ADN để tìm ra điểm khác biệt về nguyên tắc và mạch khuôn."
    },
    {
      "question_number": 29,
      "question": "Loại đột biến nào làm thay đổi số lượng NST trong tế bào?",
      "answer_options": [
        {"text": "Đột biến gen", "rationale": "Sai. Đột biến gen chỉ thay đổi cấu trúc của một gen.", "isCorrect": false},
        {"text": "Đột biến cấu trúc NST", "rationale": "Sai. Đột biến cấu trúc chỉ thay đổi cấu trúc bên trong một hoặc một vài NST.", "isCorrect": false},
        {"text": "Đột biến lệch bội và đa bội", "rationale": "Đúng. Cả hai dạng đột biến này đều là các trường hợp làm thay đổi số lượng nhiễm sắc thể trong bộ NST.", "isCorrect": true},
        {"text": "Tất cả các loại đột biến trên", "rationale": "Sai. Đột biến gen và cấu trúc NST không làm thay đổi số NST.", "isCorrect": false}
      ],
      "hint": "Câu hỏi này kiểm tra về phân loại các dạng đột biến."
    },
    {
      "question_number": 30,
      "question": "Trong kĩ thuật di truyền, 'ADN tái tổ hợp' là phân tử ADN được tạo ra bằng cách:",
      "answer_options": [
        {"text": "Nối một gen của sinh vật này vào ADN của một sinh vật khác.", "rationale": "Sai. Cụ thể hơn là nối vào thể truyền.", "isCorrect": false},
        {"text": "Gắn một đoạn gen cần chuyển vào một thể truyền (ví dụ plasmid).", "rationale": "Đúng. ADN tái tổ hợp là một phân tử ADN nhỏ, được tạo ra trong ống nghiệm bằng cách gắn gen mong muốn vào một vector chuyển gen như plasmid.", "isCorrect": true},
        {"text": "Làm cho gen bị đột biến.", "rationale": "Sai. Đây là kĩ thuật gây đột biến.", "isCorrect": false},
        {"text": "Nhân đôi một gen lên nhiều lần.", "rationale": "Sai. Đây là kĩ thuật PCR.", "isCorrect": false}
      ],
      "hint": "Phân tích từ 'tái tổ hợp', nó có nghĩa là gì?"
    },
    {
      "question_number": 31,
      "question": "Mỗi axit amin trong chuỗi polipeptit được mã hoá bởi:",
      "answer_options": [
        {"text": "Một nucleotide trên mARN", "rationale": "Sai. Một nucleotide không đủ thông tin để mã hóa cho 20 loại axit amin.", "isCorrect": false},
        {"text": "Hai nucleotide trên mARN", "rationale": "Sai. Hai nucleotide chỉ tạo được 4^2 = 16 tổ hợp, vẫn không đủ.", "isCorrect": false},
        {"text": "Ba nucleotide kế tiếp nhau trên mARN", "rationale": "Đúng. Ba nucleotide kế tiếp nhau tạo thành một bộ ba mã hóa (codon), đủ để mã hóa cho một axit amin.", "isCorrect": true},
        {"text": "Bốn nucleotide kế tiếp nhau trên mARN", "rationale": "Sai. Mã di truyền là mã bộ ba.", "isCorrect": false}
      ],
      "hint": "Mã di truyền còn được gọi là mã gì?"
    },
    {
      "question_number": 32,
      "question": "Hội chứng nào sau đây không phải do đột biến lệch bội gây ra?",
      "answer_options": [
        {"text": "Hội chứng Down (3 NST 21)", "rationale": "Sai. Đây là thể ba, một dạng lệch bội.", "isCorrect": false},
        {"text": "Hội chứng Turner (XO)", "rationale": "Sai. Đây là thể một, một dạng lệch bội.", "isCorrect": false},
        {"text": "Hội chứng Klinefelter (XXY)", "rationale": "Sai. Đây là thể ba, một dạng lệch bội.", "isCorrect": false},
        {"text": "Ung thư máu ác tính (do mất đoạn NST 22)", "rationale": "Đúng. Dạng ung thư máu này gây ra do đột biến cấu trúc nhiễm sắc thể (mất đoạn hoặc chuyển đoạn trên NST số 22), không phải đột biến số lượng.", "isCorrect": true}
      ],
      "hint": "Hãy phân biệt giữa đột biến làm thay đổi số lượng NST và đột biến làm thay đổi cấu trúc NST."
    },
    {
      "question_number": 33,
      "question": "Điều hòa hoạt động gen ở sinh vật nhân sơ chủ yếu diễn ra ở giai đoạn nào?",
      "answer_options": [
        {"text": "Trước phiên mã", "rationale": "Sai. Cơ chế này không phổ biến ở nhân sơ.", "isCorrect": false},
        {"text": "Phiên mã", "rationale": "Đúng. Ở sinh vật nhân sơ, việc điều hòa chủ yếu diễn ra ở cấp độ phiên mã thông qua các operon, quyết định xem gen có được phiên mã thành mARN hay không.", "isCorrect": true},
        {"text": "Sau phiên mã", "rationale": "Sai. Ở sinh vật nhân sơ, mARN thường được dịch mã ngay lập tức mà không qua giai đoạn xử lý phức tạp, nên mức độ điều hòa ở giai đoạn này rất ít.", "isCorrect": false},
        {"text": "Dịch mã", "rationale": "Sai. Có sự điều hòa ở mức dịch mã nhưng không phải là chủ yếu.", "isCorrect": false}
      ],
      "hint": "So sánh với sinh vật nhân thực, cơ chế điều hòa ở sinh vật nhân sơ đơn giản hơn và tập trung vào bước nào?"
    },
    {
      "question_number": 34,
      "question": "Một gen bị đột biến mất 1 cặp A-T. Chuỗi polipeptit do gen đột biến tổng hợp so với chuỗi polipeptit của gen bình thường sẽ như thế nào?",
      "answer_options": [
        {"text": "Chắc chắn bị thay đổi từ vị trí đột biến trở đi.", "rationale": "Đúng. Mất 1 cặp nucleotide sẽ gây ra đột biến dịch khung, làm cho tất cả các bộ ba từ vị trí đột biến trở về sau bị đọc sai, dẫn đến chuỗi axit amin thay đổi hoàn toàn và thường kết thúc sớm.", "isCorrect": true},
        {"text": "Chỉ bị mất đi một axit amin.", "rationale": "Sai. Điều này chỉ xảy ra khi mất 3 cặp nucleotide.", "isCorrect": false},
        {"text": "Không thay đổi.", "rationale": "Sai. Đột biến mất 1 cặp Nu luôn gây ra hậu quả lớn.", "isCorrect": false},
        {"text": "Chỉ thay đổi một axit amin.", "rationale": "Sai. Đây là hậu quả của đột biến thay thế, không phải đột biến mất.", "isCorrect": false}
      ],
      "hint": "Mất một cặp nucleotide có phải là bội số của 3 không? Nó sẽ ảnh hưởng đến khung đọc như thế nào?"
    },
    {
      "question_number": 35,
      "question": "Thành tựu nào sau đây là ứng dụng của công nghệ gen để tạo sinh vật chuyển gen?",
      "answer_options": [
        {"text": "Nuôi cấy mô tế bào để nhân giống nhanh cây trồng.", "rationale": "Sai. Đây là ứng dụng của công nghệ tế bào thực vật.", "isCorrect": false},
        {"text": "Tạo cây bông có khả năng kháng thuốc diệt cỏ.", "rationale": "Đúng. Bằng cách chuyển gen kháng thuốc diệt cỏ từ vi khuẩn vào cây bông, người ta đã tạo ra giống bông biến đổi gen có đặc tính này.", "isCorrect": true},
        {"text": "Tạo cừu Dolly bằng phương pháp nhân bản vô tính.", "rationale": "Sai. Đây là công nghệ tế bào động vật.", "isCorrect": false},
        {"text": "Tạo giống lúa tứ bội có năng suất cao.", "rationale": "Sai. Đây là ứng dụng của gây đột biến đa bội.", "isCorrect": false}
      ],
      "hint": "Sinh vật chuyển gen là sinh vật nhận được một gen từ một loài khác. Hãy tìm ví dụ phù hợp."
    },
    {
      "question_number": 36,
      "question": "Sợi nhiễm sắc có đường kính 30 nm được tạo thành do:",
      "answer_options": [
        {"text": "Phân tử ADN quấn quanh khối protein histone.", "rationale": "Sai. Đây là cấu trúc của nucleosome, tạo ra sợi cơ bản 11 nm.", "isCorrect": false},
        {"text": "Sợi cơ bản (11 nm) xoắn lại thành một bậc cao hơn.", "rationale": "Đúng. Sợi cơ bản (chuỗi nucleosome) xoắn lại theo kiểu xoắn ốc (solenoid), tạo thành sợi nhiễm sắc có đường kính 30 nm.", "isCorrect": true},
        {"text": "Sợi nhiễm sắc (30 nm) tiếp tục được xếp cuộn.", "rationale": "Sai. Cấu trúc này sẽ tạo ra sợi siêu xoắn 300 nm.", "isCorrect": false},
        {"text": "Nhiễm sắc thể đóng xoắn cực đại.", "rationale": "Sai. Đây là cấu trúc chromatid có đường kính lên tới 700 nm.", "isCorrect": false}
      ],
      "hint": "Đây là mức độ đóng xoắn thứ hai trong cấu trúc siêu hiển vi của nhiễm sắc thể."
    },
    {
      "question_number": 37,
      "question": "Trong quá trình phiên mã, trình tự nucleotide của mARN được tổng hợp dựa trên:",
      "answer_options": [
        {"text": "Trình tự nucleotide của cả hai mạch ADN.", "rationale": "Sai. Chỉ một mạch được sử dụng làm khuôn.", "isCorrect": false},
        {"text": "Trình tự nucleotide trên mạch mã gốc (3'→5') của gen.", "rationale": "Đúng. mARN được tổng hợp theo nguyên tắc bổ sung với mạch mã gốc.", "isCorrect": true},
        {"text": "Trình tự nucleotide trên mạch bổ sung (5'→3') của gen.", "rationale": "Sai. Mạch bổ sung không được dùng làm khuôn trực tiếp cho phiên mã.", "isCorrect": false},
        {"text": "Trình tự của các tARN trong tế bào chất.", "rationale": "Sai. tARN tham gia vào dịch mã, không phải phiên mã.", "isCorrect": false}
      ],
      "hint": "Quá trình này cần một 'bản thiết kế' để sao chép. Bản thiết kế đó là gì?"
    },
    {
      "question_number": 38,
      "question": "Cơ chế nào sau đây có thể tạo ra các alen mới cho một gen?",
      "answer_options": [
        {"text": "Hoán vị gen", "rationale": "Sai. Hoán vị gen chỉ tạo ra sự tổ hợp lại các alen đã có, không tạo alen mới.", "isCorrect": false},
        {"text": "Phân li độc lập", "rationale": "Sai. Phân li độc lập cũng chỉ tổ hợp lại các alen đã có.", "isCorrect": false},
        {"text": "Đột biến gen", "rationale": "Đúng. Đột biến gen là quá trình làm thay đổi cấu trúc của gen (thay đổi trình tự nucleotide), qua đó tạo ra các alen mới, làm phong phú vốn gen của quần thể.", "isCorrect": true},
        {"text": "Thường biến", "rationale": "Sai. Thường biến là những biến đổi kiểu hình không do thay đổi kiểu gen, không di truyền được.", "isCorrect": false}
      ],
      "hint": "Alen là các trạng thái khác nhau của cùng một gen. Sự thay đổi nào có thể tạo ra một 'phiên bản' mới của gen?"
    },
    {
      "question_number": 39,
      "question": "Ở sinh vật nhân thực, mARN trưởng thành khác mARN sơ khai ở chỗ:",
      "answer_options": [
        {"text": "Không có vùng điều hòa.", "rationale": "Sai. Cả hai đều không có vùng điều hòa (vùng điều hòa thuộc về gen).", "isCorrect": false},
        {"text": "Không có các đoạn intron.", "rationale": "Đúng. Quá trình xử lý ARN sau phiên mã ở nhân thực bao gồm việc cắt bỏ các đoạn không mã hóa (intron) và nối các đoạn mã hóa (exon) lại với nhau.", "isCorrect": true},
        {"text": "Chỉ chứa các đoạn intron.", "rationale": "Sai. Ngược lại, nó chỉ chứa các exon.", "isCorrect": false},
        {"text": "Có chiều 3' → 5'.", "rationale": "Sai. Tất cả các mARN đều có chiều 5' → 3'.", "isCorrect": false}
      ],
      "hint": "Hãy nhớ lại quá trình 'chế biến' mARN trong tế bào nhân thực."
    },
    {
      "question_number": 40,
      "question": "Tế bào sinh dưỡng của một người bị hội chứng Down có bao nhiêu nhiễm sắc thể?",
      "answer_options": [
        {"text": "46", "rationale": "Sai. Đây là số NST của người bình thường.", "isCorrect": false},
        {"text": "45", "rationale": "Sai. Đây là số NST của người bị hội chứng Turner.", "isCorrect": false},
        {"text": "47", "rationale": "Đúng. Người bị hội chứng Down có 3 NST ở cặp 21, do đó tổng số NST là 44 NST thường + 2 NST giới tính + 1 NST 21 thừa = 47.", "isCorrect": true},
        {"text": "48", "rationale": "Sai. Số NST này không phải là đặc trưng của hội chứng Down.", "isCorrect": false}
      ],
      "hint": "Hội chứng Down là một dạng thể ba (2n+1). Hãy tính toán với bộ NST lưỡng bội của người (2n=46)."
    },
    {
      "question_number": 41,
      "question": "Hiện tượng một tính trạng do nhiều gen không alen tương tác với nhau theo kiểu bổ sung được gọi là gì?",
      "answer_options": [
        {"text": "Gen đa hiệu", "rationale": "Sai. Gen đa hiệu là một gen ảnh hưởng đến nhiều tính trạng.", "isCorrect": false},
        {"text": "Tương tác cộng gộp", "rationale": "Sai. Tương tác cộng gộp là khi mỗi alen trội đều góp một phần như nhau vào sự biểu hiện của tính trạng.", "isCorrect": false},
        {"text": "Tương tác bổ sung", "rationale": "Đúng. Đây là trường hợp hai hay nhiều gen không alen cùng tác động để hình thành nên một kiểu hình mới, khác với khi mỗi gen tác động riêng lẻ.", "isCorrect": true},
        {"text": "Trội không hoàn toàn", "rationale": "Sai. Trội không hoàn toàn là sự tương tác giữa các alen của cùng một gen.", "isCorrect": false}
      ],
      "hint": "Đây là một trong các quy luật di truyền mở rộng của Mendel."
    },
    {
      "question_number": 42,
      "question": "Phát biểu nào sau đây không đúng về đột biến cấu trúc nhiễm sắc thể?",
      "answer_options": [
        {"text": "Là những biến đổi trong cấu trúc của NST.", "rationale": "Đúng. Đây là định nghĩa của đột biến cấu trúc NST.", "isCorrect": false},
        {"text": "Có thể làm thay đổi hình dạng và kích thước của NST.", "rationale": "Đúng. Ví dụ, mất đoạn làm NST ngắn lại, chuyển đoạn không cân cũng làm thay đổi kích thước.", "isCorrect": false},
        {"text": "Luôn làm thay đổi số lượng gen trên NST.", "rationale": "Sai. Đột biến đảo đoạn và chuyển đoạn trên cùng một NST không làm thay đổi số lượng gen.", "isCorrect": true},
        {"text": "Có thể gây ra bệnh, tật di truyền ở người.", "rationale": "Đúng. Ví dụ, hội chứng mèo kêu do mất đoạn NST số 5, ung thư máu do chuyển đoạn NST.", "isCorrect": false}
      ],
      "hint": "Hãy xem xét các dạng đột biến cấu trúc (mất, lặp, đảo, chuyển đoạn) và phân tích xem dạng nào không làm thay đổi số lượng gen."
    },
    {
      "question_number": 43,
      "question": "Trong quá trình tạo cừu Dolly, tế bào nào đã được sử dụng làm tế bào cho nhân?",
      "answer_options": [
        {"text": "Tế bào trứng", "rationale": "Sai. Tế bào trứng được sử dụng làm tế bào nhận nhân sau khi đã loại bỏ nhân của chính nó.", "isCorrect": false},
        {"text": "Tế bào tinh trùng", "rationale": "Sai. Tinh trùng là giao tử, không được sử dụng trong kĩ thuật này.", "isCorrect": false},
        {"text": "Tế bào tuyến vú", "rationale": "Đúng. Các nhà khoa học đã lấy nhân từ một tế bào tuyến vú (một loại tế bào xôma) của một con cừu cái Finn Dorset 6 tuổi để tạo ra Dolly.", "isCorrect": true},
        {"text": "Hợp tử", "rationale": "Sai. Hợp tử là tế bào được tạo ra từ thụ tinh, không phải là tế bào cho nhân trong trường hợp này.", "isCorrect": false}
      ],
      "hint": "Dolly là một bản sao của con cừu mẹ 'di truyền'. Vật chất di truyền được lấy từ loại tế bào nào của con cừu mẹ đó?"
    },
    {
      "question_number": 44,
      "question": "Quá trình nào sau đây làm biến đổi cấu trúc của mARN sơ khai thành mARN trưởng thành ở tế bào nhân thực?",
      "answer_options": [
        {"text": "Nhân đôi", "rationale": "Sai. Nhân đôi là quá trình tạo ADN.", "isCorrect": false},
        {"text": "Phiên mã ngược", "rationale": "Sai. Phiên mã ngược là quá trình tạo ADN từ ARN, có ở một số virus.", "isCorrect": false},
        {"text": "Chế biến ARN (Cắt nối ARN)", "rationale": "Đúng. Quá trình này bao gồm việc cắt bỏ các đoạn intron không mã hóa, nối các đoạn exon mã hóa lại với nhau, và gắn thêm mũ 5' cũng như đuôi poly-A.", "isCorrect": true},
        {"text": "Hoạt hóa axit amin", "rationale": "Sai. Đây là một bước trong quá trình dịch mã.", "isCorrect": false}
      ],
      "hint": "ARN sau khi được tạo ra từ gen cần được 'biên tập' lại trước khi có thể sử dụng. Quá trình này gọi là gì?"
    },
    {
      "question_number": 45,
      "question": "Thể đa bội có thể được hình thành do sự không phân li của tất cả các cặp NST trong:",
      "answer_options": [
        {"text": "Kì sau của giảm phân I.", "rationale": "Đúng. Sự không phân li của tất cả các NST kép ở kì sau I sẽ tạo ra giao tử lưỡng bội (2n).", "isCorrect": true},
        {"text": "Kì sau của giảm phân II.", "rationale": "Đúng. Sự không phân li của tất cả các NST đơn ở kì sau II cũng tạo ra giao tử lưỡng bội (2n).", "isCorrect": true},
        {"text": "Lần nguyên phân đầu tiên của hợp tử.", "rationale": "Đúng. Sự không phân li của tất cả các NST trong lần nguyên phân đầu tiên sẽ tạo ra cơ thể tứ bội (4n).", "isCorrect": true},
        {"text": "Tất cả các trường hợp trên.", "rationale": "Đúng. Tất cả các sự kiện liệt kê đều là những cơ chế có thể dẫn đến sự hình thành thể đa bội.", "isCorrect": true}
      ],
      "hint": "Hãy xem xét các thời điểm khác nhau trong phân bào mà sự cố không phân li toàn bộ bộ NST có thể xảy ra và hậu quả của nó."
    },
    {
      "question_number": 46,
      "question": "ADN tái tổ hợp là một phân tử ADN nhỏ, có khả năng nhân đôi một cách độc lập và mang gen cần chuyển. Phân tử ADN này được tạo thành từ:",
      "answer_options": [
        {"text": "ADN của thể truyền và ADN của tế bào cho", "rationale": "Đúng. Cụ thể hơn là sự kết hợp giữa thể truyền (ví dụ plasmid) và một đoạn ADN (gen) được tách từ tế bào cho.", "isCorrect": true},
        {"text": "ADN của tế bào nhận và ADN của tế bào cho", "rationale": "Sai. ADN của tế bào nhận không tham gia vào việc tạo ra phân tử ADN tái tổ hợp.", "isCorrect": false},
        {"text": "ADN của thể truyền và ADN của tế bào nhận", "rationale": "Sai. Gen cần chuyển đến từ tế bào cho, không phải tế bào nhận.", "isCorrect": false},
        {"text": "mARN của tế bào cho và ADN của thể truyền", "rationale": "Sai. Phải dùng gen (ADN) từ tế bào cho, không phải mARN (trừ trường hợp dùng phiên mã ngược để tạo cADN).", "isCorrect": false}
      ],
      "hint": "Cấu trúc này là sự 'tổ hợp' của hai nguồn ADN nào?"
    },
    {
      "question_number": 48,
      "question": "Cơ chế phát sinh đột biến gen phụ thuộc vào các yếu tố nào?",
      "answer_options": [
        {"text": "Chỉ phụ thuộc vào tác động của môi trường bên ngoài.", "rationale": "Sai. Đột biến còn có thể phát sinh do những rối loạn sinh lí, hóa sinh bên trong cơ thể.", "isCorrect": false},
        {"text": "Chỉ phụ thuộc vào các rối loạn bên trong tế bào.", "rationale": "Sai. Các tác nhân vật lí, hóa học từ môi trường bên ngoài cũng là nguyên nhân quan trọng.", "isCorrect": false},
        {"text": "Phụ thuộc vào loại tác nhân, cường độ, liều lượng của tác nhân và đặc điểm cấu trúc của gen.", "rationale": "Đúng. Tần số và loại đột biến phụ thuộc vào bản chất của tác nhân gây đột biến cũng như tính bền vững của gen; những gen có cấu trúc dễ bị biến đổi sẽ có tần số đột biến cao hơn.", "isCorrect": true},
        {"text": "Chỉ phụ thuộc vào đặc điểm cấu trúc của gen.", "rationale": "Sai. Yếu tố tác nhân từ môi trường cũng đóng vai trò quyết định.", "isCorrect": false}
      ],
      "hint": "Sự phát sinh đột biến là kết quả của sự tương tác giữa yếu tố bên trong (bản thân gen) và yếu tố bên ngoài (tác nhân)."
    },
    {
      "question_number": 49,
      "question": "Quá trình nhân đôi ADN và phiên mã có điểm chung là gì?",
      "answer_options": [
        {"text": "Đều có sự tham gia của enzyme ADN polymerase.", "rationale": "Sai. Phiên mã cần ARN polymerase.", "isCorrect": false},
        {"text": "Đều diễn ra trên toàn bộ phân tử ADN/NST.", "rationale": "Sai. Phiên mã chỉ diễn ra trên từng gen riêng lẻ.", "isCorrect": false},
        {"text": "Mạch mới tổng hợp đều có cấu trúc gồm 2 mạch polinucleotit.", "rationale": "Sai. Sản phẩm phiên mã là ARN chỉ có một mạch.", "isCorrect": false},
        {"text": "Đều diễn ra theo nguyên tắc bổ sung.", "rationale": "Đúng. Cả hai quá trình đều tuân thủ nguyên tắc bổ sung giữa các nucleotide của mạch khuôn và các nucleotide tự do trong môi trường.", "isCorrect": true}
      ],
      "hint": "Hãy tìm một nguyên tắc cơ bản nhất đảm bảo sự sao chép thông tin chính xác trong cả hai quá trình."
    },
    {
      "question_number": 50,
      "question": "Sự kiện nào sau đây thể hiện tính đặc hiệu của mã di truyền?",
      "answer_options": [
        {"text": "Bộ ba 5'AUG3' mã hóa Met ở người và cả ở vi khuẩn E.coli.", "rationale": "Sai. Đây là ví dụ về tính phổ biến của mã di truyền.", "isCorrect": false},
        {"text": "Cả hai bộ ba 5'UUU3' và 5'UUX3' đều mã hóa cho axit amin Phe.", "rationale": "Sai. Đây là ví dụ về tính thoái hóa của mã di truyền.", "isCorrect": false},
        {"text": "Bộ ba 5'GUA3' chỉ mã hóa cho Val mà không mã hóa cho axit amin nào khác.", "rationale": "Đúng. Tính đặc hiệu có nghĩa là một bộ ba chỉ xác định một loại axit amin duy nhất.", "isCorrect": true},
        {"text": "Bộ ba 5'UGA3' không mã hóa cho axit amin nào.", "rationale": "Sai. Đây là đặc điểm của bộ ba kết thúc.", "isCorrect": false}
      ],
      "hint": "Tính đặc hiệu có nghĩa là 'một - một', một codon cho một axit amin."
    },
    {
      "question_number": 51,
      "question": "Dạng đột biến nào làm tăng chiều dài của phân tử ADN nhưng không làm thay đổi số lượng gen?",
      "answer_options": [
        {"text": "Lặp đoạn", "rationale": "Sai. Lặp đoạn làm tăng cả chiều dài ADN và số lượng gen.", "isCorrect": false},
        {"text": "Thêm một cặp nuclêôtit", "rationale": "Đúng. Đột biến gen dạng thêm 1 cặp Nu sẽ làm tăng chiều dài phân tử ADN (thêm 3.4 Å) nhưng không làm thay đổi tổng số gen trên NST đó.", "isCorrect": true},
        {"text": "Đột biến tam bội", "rationale": "Sai. Đây là đột biến số lượng NST, làm tăng chiều dài của toàn bộ vật chất di truyền trong nhân, không phải của một phân tử ADN (gen).", "isCorrect": false},
        {"text": "Đảo đoạn", "rationale": "Sai. Đảo đoạn không làm thay đổi chiều dài phân tử ADN.", "isCorrect": false}
      ],
      "hint": "Câu hỏi này yêu cầu phân biệt giữa thay đổi ở cấp độ gen và cấp độ NST."
    },
    {
      "question_number": 52,
      "question": "Trong các phép lai tạo giống, để khắc phục hiện tượng bất thụ của con lai xa, người ta thường sử dụng phương pháp nào?",
      "answer_options": [
        {"text": "Gây đột biến gen", "rationale": "Sai. Đột biến gen không giải quyết được vấn đề không tương đồng giữa các bộ NST.", "isCorrect": false},
        {"text": "Lai phân tích", "rationale": "Sai. Lai phân tích dùng để xác định kiểu gen của cá thể trội.", "isCorrect": false},
        {"text": "Tự thụ phấn", "rationale": "Sai. Con lai xa thường bất thụ nên không thể tự thụ phấn.", "isCorrect": false},
        {"text": "Đa bội hóa", "rationale": "Đúng. Con lai xa bất thụ do có bộ NST của hai loài không tương đồng, không thể tiếp hợp trong giảm phân. Đa bội hóa sẽ tạo ra cơ thể song nhị bội, trong đó mỗi NST đều có một NST tương đồng để bắt cặp, giúp cơ thể có khả năng giảm phân và sinh sản hữu tính.", "isCorrect": true}
      ],
      "hint": "Con lai xa bất thụ vì sao? Làm thế nào để mỗi NST trong bộ gen của nó đều có 'bạn đồng hành' trong giảm phân?"
    },
    {
      "question_number": 53,
      "question": "Đột biến số lượng NST là những biến đổi về:",
      "answer_options": [
        {"text": "Số lượng ở một hoặc một số cặp NST hoặc toàn bộ bộ NST.", "rationale": "Đúng. Đây là định nghĩa đầy đủ, bao gồm cả lệch bội (thay đổi ở một hoặc một số cặp) và đa bội (thay đổi toàn bộ bộ NST).", "isCorrect": true},
        {"text": "Chỉ ở một cặp NST duy nhất.", "rationale": "Sai. Đây chỉ là một trường hợp của đột biến lệch bội.", "isCorrect": false},
        {"text": "Chỉ ở toàn bộ bộ NST.", "rationale": "Sai. Đây chỉ là trường hợp đột biến đa bội.", "isCorrect": false},
        {"text": "Cấu trúc và hình dạng của một số NST.", "rationale": "Sai. Đây là định nghĩa của đột biến cấu trúc NST.", "isCorrect": false}
      ],
      "hint": "Hãy xem xét cả hai loại đột biến số lượng NST đã học: lệch bội và đa bội."
    },
    {
      "question_number": 54,
      "question": "Một gen ở vi khuẩn E.coli bị đột biến điểm. Dạng đột biến nào sau đây chắc chắn sẽ làm thay đổi chức năng của protein do nó mã hoá?",
      "answer_options": [
        {"text": "Thay thế cặp A-T bằng G-X ở bộ ba cuối cùng.", "rationale": "Sai. Có thể là đột biến đồng nghĩa hoặc sai nghĩa nhưng không ảnh hưởng nhiều.", "isCorrect": false},
        {"text": "Mất một cặp nuclêôtit ở vị trí đầu tiên của vùng mã hoá.", "rationale": "Đúng. Mất một cặp Nu ở đầu vùng mã hóa sẽ gây đột biến dịch khung, làm thay đổi toàn bộ các axit amin từ đó về sau và gần như chắc chắn làm protein mất chức năng.", "isCorrect": true},
        {"text": "Thay thế cặp G-X bằng A-T.", "rationale": "Sai. Có thể đây là đột biến đồng nghĩa, không làm thay đổi axit amin.", "isCorrect": false},
        {"text": "Mất ba cặp nuclêôtit liền kề.", "rationale": "Sai. Mất 3 cặp Nu chỉ làm mất đi một axit amin, có thể làm thay đổi chức năng nhưng không 'chắc chắn' bằng đột biến dịch khung.", "isCorrect": false}
      ],
      "hint": "Loại đột biến nào gây ra sự thay đổi lớn nhất và nghiêm trọng nhất đối với trình tự axit amin?"
    },
    {
      "question_number": 55,
      "question": "Trong kĩ thuật di truyền, sau khi đưa ADN tái tổ hợp vào tế bào nhận, làm thế nào để chọn lọc được những tế bào đã nhận được ADN tái tổ hợp thành công?",
      "answer_options": [
        {"text": "Quan sát tế bào dưới kính hiển vi.", "rationale": "Sai. Không thể nhìn thấy phân tử ADN tái tổ hợp bằng kính hiển vi quang học.", "isCorrect": false},
        {"text": "Nuôi cấy tế bào trên môi trường có chứa chất kháng sinh.", "rationale": "Đúng. Thể truyền (plasmid) thường được thiết kế để mang theo một gen đánh dấu, ví dụ như gen kháng kháng sinh. Khi nuôi cấy các tế bào trên môi trường có kháng sinh, chỉ những tế bào nào đã nhận thành công plasmid (mang gen kháng) mới có thể sống sót và phát triển.", "isCorrect": true},
        {"text": "Đo pH của môi trường nuôi cấy.", "rationale": "Sai. pH không phải là chỉ thị cho việc biến nạp thành công.", "isCorrect": false},
        {"text": "Sử dụng kĩ thuật PCR.", "rationale": "Sai. PCR có thể dùng để kiểm tra sự hiện diện của gen, nhưng phương pháp chọn lọc trên môi trường nuôi cấy là phương pháp phổ biến để phân lập các dòng tế bào thành công.", "isCorrect": false}
      ],
      "hint": "Hãy nhớ lại cấu trúc của một vector chuyển gen. Ngoài vị trí để chèn gen, nó còn có thành phần nào giúp cho việc nhận biết?"
    },
    {
      "question_number": 56,
      "question": "Ở người, bệnh mù màu (đỏ-lục) là do gen lặn nằm trên NST giới tính X. Một người phụ nữ bình thường có bố bị mù màu lấy một người đàn ông bình thường. Khả năng sinh con trai bị mù màu của họ là bao nhiêu?",
      "answer_options": [
        {"text": "100%", "rationale": "Sai. Người mẹ là thể mang gen, có khả năng truyền cả alen trội và lặn.", "isCorrect": false},
        {"text": "50%", "rationale": "Sai. Đây là tỉ lệ con trai bị bệnh trên tổng số con trai, không phải trên tổng số con.", "isCorrect": false},
        {"text": "25%", "rationale": "Đúng. Phụ nữ bình thường có bố bị mù màu (X^aY) sẽ có kiểu gen X^AX^a. Người đàn ông bình thường có kiểu gen X^AY. Phép lai: X^AX^a x X^AY. Xác suất sinh con trai (X^aY) là 1/4 (1/2 X^a từ mẹ * 1/2 Y từ bố).", "isCorrect": true},
        {"text": "0%", "rationale": "Sai. Người mẹ mang gen lặn nên có khả năng sinh con bị bệnh.", "isCorrect": false}
      ],
      "hint": "Đầu tiên, xác định kiểu gen của bố và mẹ. Sau đó, viết sơ đồ lai và tính xác suất cho kiểu hình yêu cầu."
    },
    {
      "question_number": 57,
      "question": "Sự nhân đôi của ADN trên mạch khuôn 3' → 5' diễn ra...",
      "answer_options": [
        {"text": "liên tục.", "rationale": "Đúng. Vì enzyme ADN polymerase tổng hợp mạch mới theo chiều 5' → 3', nên trên mạch khuôn 3' → 5', nó có thể tổng hợp một cách liên tục theo chiều tháo xoắn của chạc tái bản.", "isCorrect": true},
        {"text": "gián đoạn.", "rationale": "Sai. Sự tổng hợp gián đoạn xảy ra trên mạch khuôn 5' → 3'.", "isCorrect": false},
        {"text": "theo từng đoạn Okazaki.", "rationale": "Sai. Đây là đặc điểm của mạch được tổng hợp gián đoạn.", "isCorrect": false},
        {"text": "cần nhiều đoạn mồi ARN.", "rationale": "Sai. Mạch tổng hợp liên tục chỉ cần một đoạn mồi ARN ở điểm khởi đầu.", "isCorrect": false}
      ],
      "hint": "Hãy nhớ lại mối quan hệ giữa chiều của mạch khuôn và chiều tổng hợp của mạch mới."
    },
    {
      "question_number": 58,
      "question": "Nhiễm sắc thể của sinh vật nhân sơ (vi khuẩn) có đặc điểm cấu trúc nào sau đây?",
      "answer_options": [
        {"text": "Dạng thẳng và có nhiều phân tử.", "rationale": "Sai. Đây là đặc điểm của NST ở sinh vật nhân thực.", "isCorrect": false},
        {"text": "Dạng vòng, được cấu tạo từ ADN và protein histone.", "rationale": "Sai. ADN của vi khuẩn không liên kết với protein histone.", "isCorrect": false},
        {"text": "Dạng vòng, phân tử ADN trần.", "rationale": "Đúng. Vật chất di truyền chính của vi khuẩn là một phân tử ADN dạng vòng, trần (không liên kết với protein histone), nằm trong vùng nhân.", "isCorrect": true},
        {"text": "Dạng thẳng, không liên kết với protein.", "rationale": "Sai. NST của vi khuẩn có dạng vòng.", "isCorrect": false}
      ],
      "hint": "So sánh cấu trúc nhiễm sắc thể giữa tế bào không có nhân chính thức và tế bào có nhân chính thức."
    },
    {
      "question_number": 59,
      "question": "Quá trình nào sau đây không phải là một cấp độ điều hòa biểu hiện gen ở sinh vật nhân thực?",
      "answer_options": [
        {"text": "Điều hòa ở cấp độ cấu trúc nhiễm sắc thể (đóng/tháo xoắn).", "rationale": "Sai. Đây là cấp độ điều hòa trước phiên mã, rất quan trọng ở nhân thực.", "isCorrect": false},
        {"text": "Điều hòa ở cấp độ phiên mã (tương tác của các yếu tố phiên mã).", "rationale": "Sai. Đây là cấp độ điều hòa chủ yếu.", "isCorrect": false},
        {"text": "Điều hòa ở cấp độ sau phiên mã (cắt nối ARN, tuổi thọ mARN).", "rationale": "Sai. Đây là một cấp độ điều hòa quan trọng.", "isCorrect": false},
        {"text": "Điều hòa ở cấp độ tự nhân đôi ADN.", "rationale": "Đúng. Tự nhân đôi ADN là quá trình truyền đạt vật chất di truyền, không phải là quá trình biểu hiện gen (tạo ra sản phẩm chức năng). Việc kiểm soát chu kì tế bào là một dạng điều hòa khác.", "isCorrect": true}
      ],
      "hint": "Điều hòa biểu hiện gen là kiểm soát quá trình tạo ra sản phẩm chức năng (ARN hoặc protein) từ gen. Quá trình nào không tạo ra sản phẩm chức năng?"
    },
    {
      "question_number": 60,
      "question": "Một người phụ nữ mang bộ NST gồm 44 NST thường và 1 NST giới tính X (hội chứng Turner) được hình thành do sự kết hợp giữa:",
      "answer_options": [
        {"text": "Giao tử bình thường (22+X) và giao tử không chứa NST giới tính (22+O).", "rationale": "Đúng. Hợp tử XO có thể được tạo thành do trứng bình thường (X) thụ tinh với tinh trùng không có NST giới tính (O), hoặc do trứng (O) thụ tinh với tinh trùng bình thường (X).", "isCorrect": true},
        {"text": "Giao tử (22+X) và giao tử (22+Y).", "rationale": "Sai. Sự kết hợp này tạo ra hợp tử XY (nam giới bình thường).", "isCorrect": false},
        {"text": "Giao tử (22+XX) và giao tử (22+Y).", "rationale": "Sai. Sự kết hợp này tạo ra hợp tử XXY (hội chứng Klinefelter).", "isCorrect": false},
        {"text": "Giao tử (22+X) và giao tử (22+X).", "rationale": "Sai. Sự kết hợp này tạo ra hợp tử XX (nữ giới bình thường).", "isCorrect": false}
      ],
      "hint": "Bộ NST của người này là XO. Hãy xem xét các tổ hợp giao tử nào có thể tạo ra hợp tử này."
    },
    {
      "question_number": 61,
      "question": "Đột biến điểm là những biến đổi liên quan đến bao nhiêu cặp nucleotide?",
      "answer_options": [
        {"text": "Một cặp nucleotide", "rationale": "Đúng. Theo định nghĩa, đột biến điểm là những thay đổi chỉ liên quan đến một cặp nucleotide duy nhất trong gen (mất, thêm, hoặc thay thế).", "isCorrect": true},
        {"text": "Hai cặp nucleotide", "rationale": "Sai. Đây không còn được gọi là đột biến điểm.", "isCorrect": false},
        {"text": "Ba cặp nucleotide", "rationale": "Sai. Đây không còn được gọi là đột biến điểm.", "isCorrect": false},
        {"text": "Một số cặp nucleotide", "rationale": "Sai. 'Một số' là khái niệm chung cho đột biến gen, còn 'đột biến điểm' chỉ giới hạn ở một cặp.", "isCorrect": false}
      ],
      "hint": "Từ 'điểm' trong 'đột biến điểm' có ý nghĩa gì?"
    },
    {
      "question_number": 62,
      "question": "Cho các phát biểu về hệ gen của sinh vật:\n(1) Hệ gen của một loài là toàn bộ vật chất di truyền có trong một tế bào của loài đó.\n(2) Hệ gen của vi khuẩn chỉ bao gồm một phân tử ADN dạng vòng ở vùng nhân.\n(3) Ở sinh vật nhân thực, hệ gen bao gồm ADN trong nhân và ADN trong các bào quan (ti thể, lục lạp).\n(4) Kích thước hệ gen tỉ lệ thuận với mức độ tiến hóa của loài.\nCó bao nhiêu phát biểu đúng?",
      "answer_options": [
        {"text": "1", "rationale": "Sai. Có 2 phát biểu đúng.", "isCorrect": false},
        {"text": "2", "rationale": "Đúng. (1) đúng - đây là định nghĩa. (3) đúng - hệ gen nhân thực bao gồm cả ADN ngoài nhân. (2) sai - ngoài ADN ở vùng nhân, nhiều vi khuẩn còn có các plasmid. (4) sai - không có mối tương quan rõ ràng giữa kích thước hệ gen và mức độ phức tạp của cơ thể.", "isCorrect": true},
        {"text": "3", "rationale": "Sai. (2) và (4) sai.", "isCorrect": false},
        {"text": "4", "rationale": "Sai. (2) và (4) sai.", "isCorrect": false}
      ],
      "hint": "Hệ gen bao gồm tất cả các phân tử ADN trong tế bào. Hãy xem xét các thành phần này ở vi khuẩn và sinh vật nhân thực."
    },
    {
      "question_number": 63,
      "question": "Dạng đột biến cấu trúc NST nào có thể dẫn đến sự hình thành gen mới?",
      "answer_options": [
        {"text": "Mất đoạn", "rationale": "Sai. Mất đoạn làm mất gen.", "isCorrect": false},
        {"text": "Lặp đoạn", "rationale": "Đúng. Khi một gen được nhân đôi (lặp đoạn), một bản sao có thể được tự do đột biến mà không ảnh hưởng đến chức năng của bản sao gốc. Qua thời gian, bản sao đột biến này có thể tích lũy đủ thay đổi để trở thành một gen mới với chức năng mới.", "isCorrect": true},
        {"text": "Đảo đoạn", "rationale": "Sai. Đảo đoạn chỉ thay đổi trật tự gen.", "isCorrect": false},
        {"text": "Chuyển đoạn", "rationale": "Sai. Chuyển đoạn có thể tạo ra gen dung hợp (fusion gene) nhưng cơ chế chính tạo gen mới là lặp đoạn và đột biến.", "isCorrect": false}
      ],
      "hint": "Sự hình thành gen mới đòi hỏi phải có 'vật liệu' di truyền dư thừa để có thể 'thử nghiệm' các chức năng mới mà không làm hỏng chức năng cũ."
    },
    {
      "question_number": 64,
      "question": "Trong quá trình phiên mã, mạch nào của gen được dùng làm khuôn?",
      "answer_options": [
        {"text": "Cả hai mạch.", "rationale": "Sai. Chỉ một mạch được dùng làm khuôn cho một lần phiên mã của một gen.", "isCorrect": false},
        {"text": "Mạch có chiều 5' → 3'.", "rationale": "Sai. Mạch này được gọi là mạch bổ sung (không làm khuôn).", "isCorrect": false},
        {"text": "Mạch có chiều 3' → 5'.", "rationale": "Đúng. Mạch này được gọi là mạch mã gốc (hay mạch khuôn) vì enzyme ARN polymerase trượt trên nó để tổng hợp mARN theo chiều 5' → 3'.", "isCorrect": true},
        {"text": "Mạch nào cũng được, tùy thuộc vào môi trường.", "rationale": "Sai. Việc chọn mạch nào làm khuôn là đặc trưng cho từng gen, không thay đổi.", "isCorrect": false}
      ],
      "hint": "Hãy nhớ lại chiều tổng hợp của mARN và chiều di chuyển của enzyme ARN polymerase."
    },
    {
      "question_number": 65,
      "question": "Sự khác biệt chính trong điều hòa biểu hiện gen giữa tế bào nhân sơ và tế bào nhân thực là gì?",
      "answer_options": [
        {"text": "Tế bào nhân sơ không có cơ chế điều hòa.", "rationale": "Sai. Tế bào nhân sơ có cơ chế điều hòa, điển hình là mô hình operon.", "isCorrect": false},
        {"text": "Tế bào nhân thực có cơ chế điều hòa phức tạp hơn, ở nhiều cấp độ hơn.", "rationale": "Đúng. Do cấu trúc gen phân mảnh, có NST, có màng nhân... nên tế bào nhân thực điều hòa ở nhiều cấp độ: cấu trúc NST, phiên mã, sau phiên mã, dịch mã, sau dịch mã. Còn ở nhân sơ, chủ yếu là điều hòa ở cấp độ phiên mã.", "isCorrect": true},
        {"text": "Tế bào nhân sơ điều hòa ở cấp độ dịch mã là chủ yếu.", "rationale": "Sai. Chủ yếu ở nhân sơ là cấp độ phiên mã.", "isCorrect": false},
        {"text": "Tế bào nhân thực không có các operon.", "rationale": "Sai. Mặc dù mô hình operon điển hình cho nhân sơ, nhưng các cụm gen chức năng được điều hòa chung cũng tồn tại ở nhân thực, dù cơ chế phức tạp hơn.", "isCorrect": false}
      ],
      "hint": "So sánh sự phức tạp về cấu trúc tế bào (nhân, NST) và cấu trúc gen (intron) giữa hai nhóm sinh vật này."
    }
  ]
}
